Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/pio/samrh71f20b.h
/**
 * \brief Peripheral I/O description for SAMRH71F20B
 *
 * Copyright (c) 2020 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2020-01-08T10:05:46Z */
#ifndef _SAMRH71F20B_GPIO_H_
#define _SAMRH71F20B_GPIO_H_

/* ========== Peripheral I/O pin numbers ========== */
#define PIN_PA0                     (  0  )  /**< Pin Number for PA0 */
#define PIN_PA1                     (  1  )  /**< Pin Number for PA1 */
#define PIN_PA2                     (  2  )  /**< Pin Number for PA2 */
#define PIN_PA3                     (  3  )  /**< Pin Number for PA3 */
#define PIN_PA4                     (  4  )  /**< Pin Number for PA4 */
#define PIN_PA5                     (  5  )  /**< Pin Number for PA5 */
#define PIN_PA6                     (  6  )  /**< Pin Number for PA6 */
#define PIN_PA7                     (  7  )  /**< Pin Number for PA7 */
#define PIN_PA8                     (  8  )  /**< Pin Number for PA8 */
#define PIN_PA9                     (  9  )  /**< Pin Number for PA9 */
#define PIN_PA10                    ( 10  )  /**< Pin Number for PA10 */
#define PIN_PA11                    ( 11  )  /**< Pin Number for PA11 */
#define PIN_PA12                    ( 12  )  /**< Pin Number for PA12 */
#define PIN_PA13                    ( 13  )  /**< Pin Number for PA13 */
#define PIN_PA16                    ( 16  )  /**< Pin Number for PA16 */
#define PIN_PA17                    ( 17  )  /**< Pin Number for PA17 */
#define PIN_PA19                    ( 19  )  /**< Pin Number for PA19 */
#define PIN_PA20                    ( 20  )  /**< Pin Number for PA20 */
#define PIN_PA21                    ( 21  )  /**< Pin Number for PA21 */
#define PIN_PA22                    ( 22  )  /**< Pin Number for PA22 */
#define PIN_PA23                    ( 23  )  /**< Pin Number for PA23 */
#define PIN_PA24                    ( 24  )  /**< Pin Number for PA24 */
#define PIN_PA25                    ( 25  )  /**< Pin Number for PA25 */
#define PIN_PA26                    ( 26  )  /**< Pin Number for PA26 */
#define PIN_PA27                    ( 27  )  /**< Pin Number for PA27 */
#define PIN_PA28                    ( 28  )  /**< Pin Number for PA28 */
#define PIN_PB0                     ( 32  )  /**< Pin Number for PB0 */
#define PIN_PB1                     ( 33  )  /**< Pin Number for PB1 */
#define PIN_PB2                     ( 34  )  /**< Pin Number for PB2 */
#define PIN_PB3                     ( 35  )  /**< Pin Number for PB3 */
#define PIN_PB4                     ( 36  )  /**< Pin Number for PB4 */
#define PIN_PB5                     ( 37  )  /**< Pin Number for PB5 */
#define PIN_PB6                     ( 38  )  /**< Pin Number for PB6 */
#define PIN_PB7                     ( 39  )  /**< Pin Number for PB7 */
#define PIN_PB8                     ( 40  )  /**< Pin Number for PB8 */
#define PIN_PB9                     ( 41  )  /**< Pin Number for PB9 */
#define PIN_PB10                    ( 42  )  /**< Pin Number for PB10 */
#define PIN_PB11                    ( 43  )  /**< Pin Number for PB11 */
#define PIN_PB12                    ( 44  )  /**< Pin Number for PB12 */
#define PIN_PB13                    ( 45  )  /**< Pin Number for PB13 */
#define PIN_PB14                    ( 46  )  /**< Pin Number for PB14 */
#define PIN_PB15                    ( 47  )  /**< Pin Number for PB15 */
#define PIN_PB16                    ( 48  )  /**< Pin Number for PB16 */
#define PIN_PB17                    ( 49  )  /**< Pin Number for PB17 */
#define PIN_PB18                    ( 50  )  /**< Pin Number for PB18 */
#define PIN_PB19                    ( 51  )  /**< Pin Number for PB19 */
#define PIN_PB20                    ( 52  )  /**< Pin Number for PB20 */
#define PIN_PB21                    ( 53  )  /**< Pin Number for PB21 */
#define PIN_PB22                    ( 54  )  /**< Pin Number for PB22 */
#define PIN_PB23                    ( 55  )  /**< Pin Number for PB23 */
#define PIN_PB24                    ( 56  )  /**< Pin Number for PB24 */
#define PIN_PB25                    ( 57  )  /**< Pin Number for PB25 */
#define PIN_PB26                    ( 58  )  /**< Pin Number for PB26 */
#define PIN_PB27                    ( 59  )  /**< Pin Number for PB27 */
#define PIN_PB28                    ( 60  )  /**< Pin Number for PB28 */
#define PIN_PB29                    ( 61  )  /**< Pin Number for PB29 */
#define PIN_PC0                     ( 64  )  /**< Pin Number for PC0 */
#define PIN_PC1                     ( 65  )  /**< Pin Number for PC1 */
#define PIN_PC2                     ( 66  )  /**< Pin Number for PC2 */
#define PIN_PC3                     ( 67  )  /**< Pin Number for PC3 */
#define PIN_PC4                     ( 68  )  /**< Pin Number for PC4 */
#define PIN_PC5                     ( 69  )  /**< Pin Number for PC5 */
#define PIN_PC6                     ( 70  )  /**< Pin Number for PC6 */
#define PIN_PC7                     ( 71  )  /**< Pin Number for PC7 */
#define PIN_PC8                     ( 72  )  /**< Pin Number for PC8 */
#define PIN_PC9                     ( 73  )  /**< Pin Number for PC9 */
#define PIN_PC10                    ( 74  )  /**< Pin Number for PC10 */
#define PIN_PC11                    ( 75  )  /**< Pin Number for PC11 */
#define PIN_PC12                    ( 76  )  /**< Pin Number for PC12 */
#define PIN_PC13                    ( 77  )  /**< Pin Number for PC13 */
#define PIN_PC14                    ( 78  )  /**< Pin Number for PC14 */
#define PIN_PC15                    ( 79  )  /**< Pin Number for PC15 */
#define PIN_PC16                    ( 80  )  /**< Pin Number for PC16 */
#define PIN_PC17                    ( 81  )  /**< Pin Number for PC17 */
#define PIN_PC18                    ( 82  )  /**< Pin Number for PC18 */
#define PIN_PC19                    ( 83  )  /**< Pin Number for PC19 */
#define PIN_PC20                    ( 84  )  /**< Pin Number for PC20 */
#define PIN_PC21                    ( 85  )  /**< Pin Number for PC21 */
#define PIN_PC22                    ( 86  )  /**< Pin Number for PC22 */
#define PIN_PC23                    ( 87  )  /**< Pin Number for PC23 */
#define PIN_PC24                    ( 88  )  /**< Pin Number for PC24 */
#define PIN_PC25                    ( 89  )  /**< Pin Number for PC25 */
#define PIN_PC26                    ( 90  )  /**< Pin Number for PC26 */
#define PIN_PC27                    ( 91  )  /**< Pin Number for PC27 */
#define PIN_PC28                    ( 92  )  /**< Pin Number for PC28 */
#define PIN_PC29                    ( 93  )  /**< Pin Number for PC29 */
#define PIN_PC30                    ( 94  )  /**< Pin Number for PC30 */
#define PIN_PC31                    ( 95  )  /**< Pin Number for PC31 */
#define PIN_PD0                     ( 96  )  /**< Pin Number for PD0 */
#define PIN_PD1                     ( 97  )  /**< Pin Number for PD1 */
#define PIN_PD2                     ( 98  )  /**< Pin Number for PD2 */
#define PIN_PD3                     ( 99  )  /**< Pin Number for PD3 */
#define PIN_PD4                     (100  )  /**< Pin Number for PD4 */
#define PIN_PD5                     (101  )  /**< Pin Number for PD5 */
#define PIN_PD6                     (102  )  /**< Pin Number for PD6 */
#define PIN_PD7                     (103  )  /**< Pin Number for PD7 */
#define PIN_PD8                     (104  )  /**< Pin Number for PD8 */
#define PIN_PD9                     (105  )  /**< Pin Number for PD9 */
#define PIN_PD10                    (106  )  /**< Pin Number for PD10 */
#define PIN_PD11                    (107  )  /**< Pin Number for PD11 */
#define PIN_PD12                    (108  )  /**< Pin Number for PD12 */
#define PIN_PD13                    (109  )  /**< Pin Number for PD13 */
#define PIN_PD14                    (110  )  /**< Pin Number for PD14 */
#define PIN_PD15                    (111  )  /**< Pin Number for PD15 */
#define PIN_PD16                    (112  )  /**< Pin Number for PD16 */
#define PIN_PD17                    (113  )  /**< Pin Number for PD17 */
#define PIN_PD18                    (114  )  /**< Pin Number for PD18 */
#define PIN_PD19                    (115  )  /**< Pin Number for PD19 */
#define PIN_PD20                    (116  )  /**< Pin Number for PD20 */
#define PIN_PD21                    (117  )  /**< Pin Number for PD21 */
#define PIN_PD22                    (118  )  /**< Pin Number for PD22 */
#define PIN_PD23                    (119  )  /**< Pin Number for PD23 */
#define PIN_PD24                    (120  )  /**< Pin Number for PD24 */
#define PIN_PD25                    (121  )  /**< Pin Number for PD25 */
#define PIN_PD26                    (122  )  /**< Pin Number for PD26 */
#define PIN_PD27                    (123  )  /**< Pin Number for PD27 */
#define PIN_PD28                    (124  )  /**< Pin Number for PD28 */
#define PIN_PD29                    (125  )  /**< Pin Number for PD29 */
#define PIN_PD30                    (126  )  /**< Pin Number for PD30 */
#define PIN_PD31                    (127  )  /**< Pin Number for PD31 */
#define PIN_PE0                     (128  )  /**< Pin Number for PE0 */
#define PIN_PE1                     (129  )  /**< Pin Number for PE1 */
#define PIN_PE2                     (130  )  /**< Pin Number for PE2 */
#define PIN_PE3                     (131  )  /**< Pin Number for PE3 */
#define PIN_PE4                     (132  )  /**< Pin Number for PE4 */
#define PIN_PE5                     (133  )  /**< Pin Number for PE5 */
#define PIN_PE6                     (134  )  /**< Pin Number for PE6 */
#define PIN_PE7                     (135  )  /**< Pin Number for PE7 */
#define PIN_PE8                     (136  )  /**< Pin Number for PE8 */
#define PIN_PE9                     (137  )  /**< Pin Number for PE9 */
#define PIN_PE10                    (138  )  /**< Pin Number for PE10 */
#define PIN_PE11                    (139  )  /**< Pin Number for PE11 */
#define PIN_PE12                    (140  )  /**< Pin Number for PE12 */
#define PIN_PF0                     (160  )  /**< Pin Number for PF0 */
#define PIN_PF1                     (161  )  /**< Pin Number for PF1 */
#define PIN_PF2                     (162  )  /**< Pin Number for PF2 */
#define PIN_PF3                     (163  )  /**< Pin Number for PF3 */
#define PIN_PF4                     (164  )  /**< Pin Number for PF4 */
#define PIN_PF5                     (165  )  /**< Pin Number for PF5 */
#define PIN_PF6                     (166  )  /**< Pin Number for PF6 */
#define PIN_PF7                     (167  )  /**< Pin Number for PF7 */
#define PIN_PF8                     (168  )  /**< Pin Number for PF8 */
#define PIN_PF9                     (169  )  /**< Pin Number for PF9 */
#define PIN_PF10                    (170  )  /**< Pin Number for PF10 */
#define PIN_PF11                    (171  )  /**< Pin Number for PF11 */
#define PIN_PF12                    (172  )  /**< Pin Number for PF12 */
#define PIN_PF13                    (173  )  /**< Pin Number for PF13 */
#define PIN_PF14                    (174  )  /**< Pin Number for PF14 */
#define PIN_PF15                    (175  )  /**< Pin Number for PF15 */
#define PIN_PF16                    (176  )  /**< Pin Number for PF16 */
#define PIN_PF17                    (177  )  /**< Pin Number for PF17 */
#define PIN_PF18                    (178  )  /**< Pin Number for PF18 */
#define PIN_PF19                    (179  )  /**< Pin Number for PF19 */
#define PIN_PF20                    (180  )  /**< Pin Number for PF20 */
#define PIN_PF21                    (181  )  /**< Pin Number for PF21 */
#define PIN_PF22                    (182  )  /**< Pin Number for PF22 */
#define PIN_PF23                    (183  )  /**< Pin Number for PF23 */
#define PIN_PF24                    (184  )  /**< Pin Number for PF24 */
#define PIN_PF25                    (185  )  /**< Pin Number for PF25 */
#define PIN_PF26                    (186  )  /**< Pin Number for PF26 */
#define PIN_PF27                    (187  )  /**< Pin Number for PF27 */
#define PIN_PF28                    (188  )  /**< Pin Number for PF28 */
#define PIN_PF29                    (189  )  /**< Pin Number for PF29 */
#define PIN_PF30                    (190  )  /**< Pin Number for PF30 */
#define PIN_PG0                     (192  )  /**< Pin Number for PG0 */
#define PIN_PG1                     (193  )  /**< Pin Number for PG1 */
#define PIN_PG2                     (194  )  /**< Pin Number for PG2 */
#define PIN_PG3                     (195  )  /**< Pin Number for PG3 */
#define PIN_PG4                     (196  )  /**< Pin Number for PG4 */
#define PIN_PG5                     (197  )  /**< Pin Number for PG5 */
#define PIN_PG6                     (198  )  /**< Pin Number for PG6 */
#define PIN_PG7                     (199  )  /**< Pin Number for PG7 */
#define PIN_PG8                     (200  )  /**< Pin Number for PG8 */
#define PIN_PG9                     (201  )  /**< Pin Number for PG9 */
#define PIN_PG10                    (202  )  /**< Pin Number for PG10 */
#define PIN_PG11                    (203  )  /**< Pin Number for PG11 */
#define PIN_PG12                    (204  )  /**< Pin Number for PG12 */
#define PIN_PG13                    (205  )  /**< Pin Number for PG13 */
#define PIN_PG14                    (206  )  /**< Pin Number for PG14 */
#define PIN_PG15                    (207  )  /**< Pin Number for PG15 */
#define PIN_PG16                    (208  )  /**< Pin Number for PG16 */
#define PIN_PG17                    (209  )  /**< Pin Number for PG17 */
#define PIN_PG18                    (210  )  /**< Pin Number for PG18 */
#define PIN_PG19                    (211  )  /**< Pin Number for PG19 */
#define PIN_PG20                    (212  )  /**< Pin Number for PG20 */
#define PIN_PG21                    (213  )  /**< Pin Number for PG21 */
#define PIN_PG22                    (214  )  /**< Pin Number for PG22 */
#define PIN_PG23                    (215  )  /**< Pin Number for PG23 */
#define PIN_PG24                    (216  )  /**< Pin Number for PG24 */
#define PIN_PG25                    (217  )  /**< Pin Number for PG25 */
#define PIN_PG26                    (218  )  /**< Pin Number for PG26 */
#define PIN_PG27                    (219  )  /**< Pin Number for PG27 */
#define PIN_PG30                    (222  )  /**< Pin Number for PG30 */
#define PIN_PG31                    (223  )  /**< Pin Number for PG31 */

