Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/pio/samrh71f20b.h
/* ========== PIO definition for FLEXCOM0 peripheral ========== */
#define PIN_PC21A_FLEXCOM0_FLEXCOM0_IO0            _L_(85)      /**< FLEXCOM0 signal: FLEXCOM0_FLEXCOM0_IO0 on PC21 mux A */
#define MUX_PC21A_FLEXCOM0_FLEXCOM0_IO0            _L_(0)       /**< FLEXCOM0 signal line function value: FLEXCOM0_FLEXCOM0_IO0 */
#define PIO_PC21A_FLEXCOM0_FLEXCOM0_IO0            _UL_(_U_(1) << 21) /**< FLEXCOM0 signal: FLEXCOM0_FLEXCOM0_IO0 */
#define PIN_PC22A_FLEXCOM0_FLEXCOM0_IO1            _L_(86)      /**< FLEXCOM0 signal: FLEXCOM0_FLEXCOM0_IO1 on PC22 mux A */
#define MUX_PC22A_FLEXCOM0_FLEXCOM0_IO1            _L_(0)       /**< FLEXCOM0 signal line function value: FLEXCOM0_FLEXCOM0_IO1 */
#define PIO_PC22A_FLEXCOM0_FLEXCOM0_IO1            _UL_(_U_(1) << 22) /**< FLEXCOM0 signal: FLEXCOM0_FLEXCOM0_IO1 */
#define PIN_PC23A_FLEXCOM0_FLEXCOM0_IO2            _L_(87)      /**< FLEXCOM0 signal: FLEXCOM0_FLEXCOM0_IO2 on PC23 mux A */
#define MUX_PC23A_FLEXCOM0_FLEXCOM0_IO2            _L_(0)       /**< FLEXCOM0 signal line function value: FLEXCOM0_FLEXCOM0_IO2 */
#define PIO_PC23A_FLEXCOM0_FLEXCOM0_IO2            _UL_(_U_(1) << 23) /**< FLEXCOM0 signal: FLEXCOM0_FLEXCOM0_IO2 */
#define PIN_PC24A_FLEXCOM0_FLEXCOM0_IO3            _L_(88)      /**< FLEXCOM0 signal: FLEXCOM0_FLEXCOM0_IO3 on PC24 mux A */
#define MUX_PC24A_FLEXCOM0_FLEXCOM0_IO3            _L_(0)       /**< FLEXCOM0 signal line function value: FLEXCOM0_FLEXCOM0_IO3 */
#define PIO_PC24A_FLEXCOM0_FLEXCOM0_IO3            _UL_(_U_(1) << 24) /**< FLEXCOM0 signal: FLEXCOM0_FLEXCOM0_IO3 */
#define PIN_PC25A_FLEXCOM0_FLEXCOM0_IO4            _L_(89)      /**< FLEXCOM0 signal: FLEXCOM0_FLEXCOM0_IO4 on PC25 mux A */
#define MUX_PC25A_FLEXCOM0_FLEXCOM0_IO4            _L_(0)       /**< FLEXCOM0 signal line function value: FLEXCOM0_FLEXCOM0_IO4 */
#define PIO_PC25A_FLEXCOM0_FLEXCOM0_IO4            _UL_(_U_(1) << 25) /**< FLEXCOM0 signal: FLEXCOM0_FLEXCOM0_IO4 */
#define PIN_PC26A_FLEXCOM0_FLEXCOM0_IO5            _L_(90)      /**< FLEXCOM0 signal: FLEXCOM0_FLEXCOM0_IO5 on PC26 mux A */
#define MUX_PC26A_FLEXCOM0_FLEXCOM0_IO5            _L_(0)       /**< FLEXCOM0 signal line function value: FLEXCOM0_FLEXCOM0_IO5 */
#define PIO_PC26A_FLEXCOM0_FLEXCOM0_IO5            _UL_(_U_(1) << 26) /**< FLEXCOM0 signal: FLEXCOM0_FLEXCOM0_IO5 */
#define PIN_PC27A_FLEXCOM0_FLEXCOM0_IO6            _L_(91)      /**< FLEXCOM0 signal: FLEXCOM0_FLEXCOM0_IO6 on PC27 mux A */
#define MUX_PC27A_FLEXCOM0_FLEXCOM0_IO6            _L_(0)       /**< FLEXCOM0 signal line function value: FLEXCOM0_FLEXCOM0_IO6 */
#define PIO_PC27A_FLEXCOM0_FLEXCOM0_IO6            _UL_(_U_(1) << 27) /**< FLEXCOM0 signal: FLEXCOM0_FLEXCOM0_IO6 */
#define PIN_PC28A_FLEXCOM0_FLEXCOM0_IO7            _L_(92)      /**< FLEXCOM0 signal: FLEXCOM0_FLEXCOM0_IO7 on PC28 mux A */
#define MUX_PC28A_FLEXCOM0_FLEXCOM0_IO7            _L_(0)       /**< FLEXCOM0 signal line function value: FLEXCOM0_FLEXCOM0_IO7 */
#define PIO_PC28A_FLEXCOM0_FLEXCOM0_IO7            _UL_(_U_(1) << 28) /**< FLEXCOM0 signal: FLEXCOM0_FLEXCOM0_IO7 */
/* ========== PIO definition for FLEXCOM1 peripheral ========== */
#define PIN_PF30A_FLEXCOM1_FLEXCOM1_IO0            _L_(190)     /**< FLEXCOM1 signal: FLEXCOM1_FLEXCOM1_IO0 on PF30 mux A */
#define MUX_PF30A_FLEXCOM1_FLEXCOM1_IO0            _L_(0)       /**< FLEXCOM1 signal line function value: FLEXCOM1_FLEXCOM1_IO0 */
#define PIO_PF30A_FLEXCOM1_FLEXCOM1_IO0            _UL_(_U_(1) << 30) /**< FLEXCOM1 signal: FLEXCOM1_FLEXCOM1_IO0 */
#define PIN_PF29A_FLEXCOM1_FLEXCOM1_IO1            _L_(189)     /**< FLEXCOM1 signal: FLEXCOM1_FLEXCOM1_IO1 on PF29 mux A */
#define MUX_PF29A_FLEXCOM1_FLEXCOM1_IO1            _L_(0)       /**< FLEXCOM1 signal line function value: FLEXCOM1_FLEXCOM1_IO1 */
#define PIO_PF29A_FLEXCOM1_FLEXCOM1_IO1            _UL_(_U_(1) << 29) /**< FLEXCOM1 signal: FLEXCOM1_FLEXCOM1_IO1 */
#define PIN_PF28A_FLEXCOM1_FLEXCOM1_IO2            _L_(188)     /**< FLEXCOM1 signal: FLEXCOM1_FLEXCOM1_IO2 on PF28 mux A */
#define MUX_PF28A_FLEXCOM1_FLEXCOM1_IO2            _L_(0)       /**< FLEXCOM1 signal line function value: FLEXCOM1_FLEXCOM1_IO2 */
#define PIO_PF28A_FLEXCOM1_FLEXCOM1_IO2            _UL_(_U_(1) << 28) /**< FLEXCOM1 signal: FLEXCOM1_FLEXCOM1_IO2 */
#define PIN_PF27A_FLEXCOM1_FLEXCOM1_IO3            _L_(187)     /**< FLEXCOM1 signal: FLEXCOM1_FLEXCOM1_IO3 on PF27 mux A */
#define MUX_PF27A_FLEXCOM1_FLEXCOM1_IO3            _L_(0)       /**< FLEXCOM1 signal line function value: FLEXCOM1_FLEXCOM1_IO3 */
#define PIO_PF27A_FLEXCOM1_FLEXCOM1_IO3            _UL_(_U_(1) << 27) /**< FLEXCOM1 signal: FLEXCOM1_FLEXCOM1_IO3 */
#define PIN_PF26A_FLEXCOM1_FLEXCOM1_IO4            _L_(186)     /**< FLEXCOM1 signal: FLEXCOM1_FLEXCOM1_IO4 on PF26 mux A */
#define MUX_PF26A_FLEXCOM1_FLEXCOM1_IO4            _L_(0)       /**< FLEXCOM1 signal line function value: FLEXCOM1_FLEXCOM1_IO4 */
#define PIO_PF26A_FLEXCOM1_FLEXCOM1_IO4            _UL_(_U_(1) << 26) /**< FLEXCOM1 signal: FLEXCOM1_FLEXCOM1_IO4 */
/* ========== PIO definition for FLEXCOM2 peripheral ========== */
#define PIN_PA2A_FLEXCOM2_FLEXCOM2_IO0             _L_(2)       /**< FLEXCOM2 signal: FLEXCOM2_FLEXCOM2_IO0 on PA2 mux A */
#define MUX_PA2A_FLEXCOM2_FLEXCOM2_IO0             _L_(0)       /**< FLEXCOM2 signal line function value: FLEXCOM2_FLEXCOM2_IO0 */
#define PIO_PA2A_FLEXCOM2_FLEXCOM2_IO0             _UL_(_U_(1) << 2) /**< FLEXCOM2 signal: FLEXCOM2_FLEXCOM2_IO0 */
#define PIN_PA6A_FLEXCOM2_FLEXCOM2_IO1             _L_(6)       /**< FLEXCOM2 signal: FLEXCOM2_FLEXCOM2_IO1 on PA6 mux A */
#define MUX_PA6A_FLEXCOM2_FLEXCOM2_IO1             _L_(0)       /**< FLEXCOM2 signal line function value: FLEXCOM2_FLEXCOM2_IO1 */
#define PIO_PA6A_FLEXCOM2_FLEXCOM2_IO1             _UL_(_U_(1) << 6) /**< FLEXCOM2 signal: FLEXCOM2_FLEXCOM2_IO1 */
#define PIN_PA8A_FLEXCOM2_FLEXCOM2_IO2             _L_(8)       /**< FLEXCOM2 signal: FLEXCOM2_FLEXCOM2_IO2 on PA8 mux A */
#define MUX_PA8A_FLEXCOM2_FLEXCOM2_IO2             _L_(0)       /**< FLEXCOM2 signal line function value: FLEXCOM2_FLEXCOM2_IO2 */
#define PIO_PA8A_FLEXCOM2_FLEXCOM2_IO2             _UL_(_U_(1) << 8) /**< FLEXCOM2 signal: FLEXCOM2_FLEXCOM2_IO2 */
#define PIN_PA7A_FLEXCOM2_FLEXCOM2_IO3             _L_(7)       /**< FLEXCOM2 signal: FLEXCOM2_FLEXCOM2_IO3 on PA7 mux A */
#define MUX_PA7A_FLEXCOM2_FLEXCOM2_IO3             _L_(0)       /**< FLEXCOM2 signal line function value: FLEXCOM2_FLEXCOM2_IO3 */
#define PIO_PA7A_FLEXCOM2_FLEXCOM2_IO3             _UL_(_U_(1) << 7) /**< FLEXCOM2 signal: FLEXCOM2_FLEXCOM2_IO3 */
#define PIN_PA3A_FLEXCOM2_FLEXCOM2_IO4             _L_(3)       /**< FLEXCOM2 signal: FLEXCOM2_FLEXCOM2_IO4 on PA3 mux A */
#define MUX_PA3A_FLEXCOM2_FLEXCOM2_IO4             _L_(0)       /**< FLEXCOM2 signal line function value: FLEXCOM2_FLEXCOM2_IO4 */
#define PIO_PA3A_FLEXCOM2_FLEXCOM2_IO4             _UL_(_U_(1) << 3) /**< FLEXCOM2 signal: FLEXCOM2_FLEXCOM2_IO4 */
/* ========== PIO definition for FLEXCOM3 peripheral ========== */
#define PIN_PA20A_FLEXCOM3_FLEXCOM3_IO0            _L_(20)      /**< FLEXCOM3 signal: FLEXCOM3_FLEXCOM3_IO0 on PA20 mux A */
#define MUX_PA20A_FLEXCOM3_FLEXCOM3_IO0            _L_(0)       /**< FLEXCOM3 signal line function value: FLEXCOM3_FLEXCOM3_IO0 */
#define PIO_PA20A_FLEXCOM3_FLEXCOM3_IO0            _UL_(_U_(1) << 20) /**< FLEXCOM3 signal: FLEXCOM3_FLEXCOM3_IO0 */
#define PIN_PA19A_FLEXCOM3_FLEXCOM3_IO1            _L_(19)      /**< FLEXCOM3 signal: FLEXCOM3_FLEXCOM3_IO1 on PA19 mux A */
#define MUX_PA19A_FLEXCOM3_FLEXCOM3_IO1            _L_(0)       /**< FLEXCOM3 signal line function value: FLEXCOM3_FLEXCOM3_IO1 */
#define PIO_PA19A_FLEXCOM3_FLEXCOM3_IO1            _UL_(_U_(1) << 19) /**< FLEXCOM3 signal: FLEXCOM3_FLEXCOM3_IO1 */
#define PIN_PA23A_FLEXCOM3_FLEXCOM3_IO2            _L_(23)      /**< FLEXCOM3 signal: FLEXCOM3_FLEXCOM3_IO2 on PA23 mux A */
#define MUX_PA23A_FLEXCOM3_FLEXCOM3_IO2            _L_(0)       /**< FLEXCOM3 signal line function value: FLEXCOM3_FLEXCOM3_IO2 */
#define PIO_PA23A_FLEXCOM3_FLEXCOM3_IO2            _UL_(_U_(1) << 23) /**< FLEXCOM3 signal: FLEXCOM3_FLEXCOM3_IO2 */
#define PIN_PA24A_FLEXCOM3_FLEXCOM3_IO3            _L_(24)      /**< FLEXCOM3 signal: FLEXCOM3_FLEXCOM3_IO3 on PA24 mux A */
#define MUX_PA24A_FLEXCOM3_FLEXCOM3_IO3            _L_(0)       /**< FLEXCOM3 signal line function value: FLEXCOM3_FLEXCOM3_IO3 */
#define PIO_PA24A_FLEXCOM3_FLEXCOM3_IO3            _UL_(_U_(1) << 24) /**< FLEXCOM3 signal: FLEXCOM3_FLEXCOM3_IO3 */
#define PIN_PA21A_FLEXCOM3_FLEXCOM3_IO4            _L_(21)      /**< FLEXCOM3 signal: FLEXCOM3_FLEXCOM3_IO4 on PA21 mux A */
#define MUX_PA21A_FLEXCOM3_FLEXCOM3_IO4            _L_(0)       /**< FLEXCOM3 signal line function value: FLEXCOM3_FLEXCOM3_IO4 */
#define PIO_PA21A_FLEXCOM3_FLEXCOM3_IO4            _UL_(_U_(1) << 21) /**< FLEXCOM3 signal: FLEXCOM3_FLEXCOM3_IO4 */
#define PIN_PA22A_FLEXCOM3_FLEXCOM3_IO5            _L_(22)      /**< FLEXCOM3 signal: FLEXCOM3_FLEXCOM3_IO5 on PA22 mux A */
#define MUX_PA22A_FLEXCOM3_FLEXCOM3_IO5            _L_(0)       /**< FLEXCOM3 signal line function value: FLEXCOM3_FLEXCOM3_IO5 */
#define PIO_PA22A_FLEXCOM3_FLEXCOM3_IO5            _UL_(_U_(1) << 22) /**< FLEXCOM3 signal: FLEXCOM3_FLEXCOM3_IO5 */
#define PIN_PA12A_FLEXCOM3_FLEXCOM3_IO6            _L_(12)      /**< FLEXCOM3 signal: FLEXCOM3_FLEXCOM3_IO6 on PA12 mux A */
#define MUX_PA12A_FLEXCOM3_FLEXCOM3_IO6            _L_(0)       /**< FLEXCOM3 signal line function value: FLEXCOM3_FLEXCOM3_IO6 */
#define PIO_PA12A_FLEXCOM3_FLEXCOM3_IO6            _UL_(_U_(1) << 12) /**< FLEXCOM3 signal: FLEXCOM3_FLEXCOM3_IO6 */
/* ========== PIO definition for FLEXCOM4 peripheral ========== */
#define PIN_PC0A_FLEXCOM4_FLEXCOM4_IO0             _L_(64)      /**< FLEXCOM4 signal: FLEXCOM4_FLEXCOM4_IO0 on PC0 mux A */
#define MUX_PC0A_FLEXCOM4_FLEXCOM4_IO0             _L_(0)       /**< FLEXCOM4 signal line function value: FLEXCOM4_FLEXCOM4_IO0 */
#define PIO_PC0A_FLEXCOM4_FLEXCOM4_IO0             _UL_(_U_(1) << 0) /**< FLEXCOM4 signal: FLEXCOM4_FLEXCOM4_IO0 */
#define PIN_PC1A_FLEXCOM4_FLEXCOM4_IO1             _L_(65)      /**< FLEXCOM4 signal: FLEXCOM4_FLEXCOM4_IO1 on PC1 mux A */
#define MUX_PC1A_FLEXCOM4_FLEXCOM4_IO1             _L_(0)       /**< FLEXCOM4 signal line function value: FLEXCOM4_FLEXCOM4_IO1 */
#define PIO_PC1A_FLEXCOM4_FLEXCOM4_IO1             _UL_(_U_(1) << 1) /**< FLEXCOM4 signal: FLEXCOM4_FLEXCOM4_IO1 */
#define PIN_PC2A_FLEXCOM4_FLEXCOM4_IO2             _L_(66)      /**< FLEXCOM4 signal: FLEXCOM4_FLEXCOM4_IO2 on PC2 mux A */
#define MUX_PC2A_FLEXCOM4_FLEXCOM4_IO2             _L_(0)       /**< FLEXCOM4 signal line function value: FLEXCOM4_FLEXCOM4_IO2 */
#define PIO_PC2A_FLEXCOM4_FLEXCOM4_IO2             _UL_(_U_(1) << 2) /**< FLEXCOM4 signal: FLEXCOM4_FLEXCOM4_IO2 */
#define PIN_PC3A_FLEXCOM4_FLEXCOM4_IO3             _L_(67)      /**< FLEXCOM4 signal: FLEXCOM4_FLEXCOM4_IO3 on PC3 mux A */
#define MUX_PC3A_FLEXCOM4_FLEXCOM4_IO3             _L_(0)       /**< FLEXCOM4 signal line function value: FLEXCOM4_FLEXCOM4_IO3 */
#define PIO_PC3A_FLEXCOM4_FLEXCOM4_IO3             _UL_(_U_(1) << 3) /**< FLEXCOM4 signal: FLEXCOM4_FLEXCOM4_IO3 */
#define PIN_PC4A_FLEXCOM4_FLEXCOM4_IO4             _L_(68)      /**< FLEXCOM4 signal: FLEXCOM4_FLEXCOM4_IO4 on PC4 mux A */
#define MUX_PC4A_FLEXCOM4_FLEXCOM4_IO4             _L_(0)       /**< FLEXCOM4 signal line function value: FLEXCOM4_FLEXCOM4_IO4 */
#define PIO_PC4A_FLEXCOM4_FLEXCOM4_IO4             _UL_(_U_(1) << 4) /**< FLEXCOM4 signal: FLEXCOM4_FLEXCOM4_IO4 */
#define PIN_PC5A_FLEXCOM4_FLEXCOM4_IO5             _L_(69)      /**< FLEXCOM4 signal: FLEXCOM4_FLEXCOM4_IO5 on PC5 mux A */
#define MUX_PC5A_FLEXCOM4_FLEXCOM4_IO5             _L_(0)       /**< FLEXCOM4 signal line function value: FLEXCOM4_FLEXCOM4_IO5 */
#define PIO_PC5A_FLEXCOM4_FLEXCOM4_IO5             _UL_(_U_(1) << 5) /**< FLEXCOM4 signal: FLEXCOM4_FLEXCOM4_IO5 */
#define PIN_PC6A_FLEXCOM4_FLEXCOM4_IO6             _L_(70)      /**< FLEXCOM4 signal: FLEXCOM4_FLEXCOM4_IO6 on PC6 mux A */
#define MUX_PC6A_FLEXCOM4_FLEXCOM4_IO6             _L_(0)       /**< FLEXCOM4 signal line function value: FLEXCOM4_FLEXCOM4_IO6 */
#define PIO_PC6A_FLEXCOM4_FLEXCOM4_IO6             _UL_(_U_(1) << 6) /**< FLEXCOM4 signal: FLEXCOM4_FLEXCOM4_IO6 */
/* ========== PIO definition for FLEXCOM5 peripheral ========== */
#define PIN_PC9A_FLEXCOM5_FLEXCOM5_IO0             _L_(73)      /**< FLEXCOM5 signal: FLEXCOM5_FLEXCOM5_IO0 on PC9 mux A */
#define MUX_PC9A_FLEXCOM5_FLEXCOM5_IO0             _L_(0)       /**< FLEXCOM5 signal line function value: FLEXCOM5_FLEXCOM5_IO0 */
#define PIO_PC9A_FLEXCOM5_FLEXCOM5_IO0             _UL_(_U_(1) << 9) /**< FLEXCOM5 signal: FLEXCOM5_FLEXCOM5_IO0 */
#define PIN_PC10A_FLEXCOM5_FLEXCOM5_IO1            _L_(74)      /**< FLEXCOM5 signal: FLEXCOM5_FLEXCOM5_IO1 on PC10 mux A */
#define MUX_PC10A_FLEXCOM5_FLEXCOM5_IO1            _L_(0)       /**< FLEXCOM5 signal line function value: FLEXCOM5_FLEXCOM5_IO1 */
#define PIO_PC10A_FLEXCOM5_FLEXCOM5_IO1            _UL_(_U_(1) << 10) /**< FLEXCOM5 signal: FLEXCOM5_FLEXCOM5_IO1 */
#define PIN_PA9A_FLEXCOM5_FLEXCOM5_IO2             _L_(9)       /**< FLEXCOM5 signal: FLEXCOM5_FLEXCOM5_IO2 on PA9 mux A */
#define MUX_PA9A_FLEXCOM5_FLEXCOM5_IO2             _L_(0)       /**< FLEXCOM5 signal line function value: FLEXCOM5_FLEXCOM5_IO2 */
#define PIO_PA9A_FLEXCOM5_FLEXCOM5_IO2             _UL_(_U_(1) << 9) /**< FLEXCOM5 signal: FLEXCOM5_FLEXCOM5_IO2 */
#define PIN_PA10A_FLEXCOM5_FLEXCOM5_IO3            _L_(10)      /**< FLEXCOM5 signal: FLEXCOM5_FLEXCOM5_IO3 on PA10 mux A */
#define MUX_PA10A_FLEXCOM5_FLEXCOM5_IO3            _L_(0)       /**< FLEXCOM5 signal line function value: FLEXCOM5_FLEXCOM5_IO3 */
#define PIO_PA10A_FLEXCOM5_FLEXCOM5_IO3            _UL_(_U_(1) << 10) /**< FLEXCOM5 signal: FLEXCOM5_FLEXCOM5_IO3 */
#define PIN_PA11A_FLEXCOM5_FLEXCOM5_IO4            _L_(11)      /**< FLEXCOM5 signal: FLEXCOM5_FLEXCOM5_IO4 on PA11 mux A */
#define MUX_PA11A_FLEXCOM5_FLEXCOM5_IO4            _L_(0)       /**< FLEXCOM5 signal line function value: FLEXCOM5_FLEXCOM5_IO4 */
#define PIO_PA11A_FLEXCOM5_FLEXCOM5_IO4            _UL_(_U_(1) << 11) /**< FLEXCOM5 signal: FLEXCOM5_FLEXCOM5_IO4 */
/* ========== PIO definition for FLEXCOM6 peripheral ========== */
#define PIN_PB6A_FLEXCOM6_FLEXCOM6_IO0             _L_(38)      /**< FLEXCOM6 signal: FLEXCOM6_FLEXCOM6_IO0 on PB6 mux A */
#define MUX_PB6A_FLEXCOM6_FLEXCOM6_IO0             _L_(0)       /**< FLEXCOM6 signal line function value: FLEXCOM6_FLEXCOM6_IO0 */
#define PIO_PB6A_FLEXCOM6_FLEXCOM6_IO0             _UL_(_U_(1) << 6) /**< FLEXCOM6 signal: FLEXCOM6_FLEXCOM6_IO0 */
#define PIN_PB7A_FLEXCOM6_FLEXCOM6_IO1             _L_(39)      /**< FLEXCOM6 signal: FLEXCOM6_FLEXCOM6_IO1 on PB7 mux A */
#define MUX_PB7A_FLEXCOM6_FLEXCOM6_IO1             _L_(0)       /**< FLEXCOM6 signal line function value: FLEXCOM6_FLEXCOM6_IO1 */
#define PIO_PB7A_FLEXCOM6_FLEXCOM6_IO1             _UL_(_U_(1) << 7) /**< FLEXCOM6 signal: FLEXCOM6_FLEXCOM6_IO1 */
/* ========== PIO definition for FLEXCOM7 peripheral ========== */
#define PIN_PB4A_FLEXCOM7_FLEXCOM7_IO0             _L_(36)      /**< FLEXCOM7 signal: FLEXCOM7_FLEXCOM7_IO0 on PB4 mux A */
#define MUX_PB4A_FLEXCOM7_FLEXCOM7_IO0             _L_(0)       /**< FLEXCOM7 signal line function value: FLEXCOM7_FLEXCOM7_IO0 */
#define PIO_PB4A_FLEXCOM7_FLEXCOM7_IO0             _UL_(_U_(1) << 4) /**< FLEXCOM7 signal: FLEXCOM7_FLEXCOM7_IO0 */
#define PIN_PB5A_FLEXCOM7_FLEXCOM7_IO1             _L_(37)      /**< FLEXCOM7 signal: FLEXCOM7_FLEXCOM7_IO1 on PB5 mux A */
#define MUX_PB5A_FLEXCOM7_FLEXCOM7_IO1             _L_(0)       /**< FLEXCOM7 signal line function value: FLEXCOM7_FLEXCOM7_IO1 */
#define PIO_PB5A_FLEXCOM7_FLEXCOM7_IO1             _UL_(_U_(1) << 5) /**< FLEXCOM7 signal: FLEXCOM7_FLEXCOM7_IO1 */
/* ========== PIO definition for FLEXCOM8 peripheral ========== */
#define PIN_PA27A_FLEXCOM8_FLEXCOM8_IO0            _L_(27)      /**< FLEXCOM8 signal: FLEXCOM8_FLEXCOM8_IO0 on PA27 mux A */
#define MUX_PA27A_FLEXCOM8_FLEXCOM8_IO0            _L_(0)       /**< FLEXCOM8 signal line function value: FLEXCOM8_FLEXCOM8_IO0 */
#define PIO_PA27A_FLEXCOM8_FLEXCOM8_IO0            _UL_(_U_(1) << 27) /**< FLEXCOM8 signal: FLEXCOM8_FLEXCOM8_IO0 */
#define PIN_PA28A_FLEXCOM8_FLEXCOM8_IO1            _L_(28)      /**< FLEXCOM8 signal: FLEXCOM8_FLEXCOM8_IO1 on PA28 mux A */
#define MUX_PA28A_FLEXCOM8_FLEXCOM8_IO1            _L_(0)       /**< FLEXCOM8 signal line function value: FLEXCOM8_FLEXCOM8_IO1 */
#define PIO_PA28A_FLEXCOM8_FLEXCOM8_IO1            _UL_(_U_(1) << 28) /**< FLEXCOM8 signal: FLEXCOM8_FLEXCOM8_IO1 */
/* ========== PIO definition for FLEXCOM9 peripheral ========== */
#define PIN_PA25A_FLEXCOM9_FLEXCOM9_IO0            _L_(25)      /**< FLEXCOM9 signal: FLEXCOM9_FLEXCOM9_IO0 on PA25 mux A */
#define MUX_PA25A_FLEXCOM9_FLEXCOM9_IO0            _L_(0)       /**< FLEXCOM9 signal line function value: FLEXCOM9_FLEXCOM9_IO0 */
#define PIO_PA25A_FLEXCOM9_FLEXCOM9_IO0            _UL_(_U_(1) << 25) /**< FLEXCOM9 signal: FLEXCOM9_FLEXCOM9_IO0 */
#define PIN_PA26A_FLEXCOM9_FLEXCOM9_IO1            _L_(26)      /**< FLEXCOM9 signal: FLEXCOM9_FLEXCOM9_IO1 on PA26 mux A */
#define MUX_PA26A_FLEXCOM9_FLEXCOM9_IO1            _L_(0)       /**< FLEXCOM9 signal line function value: FLEXCOM9_FLEXCOM9_IO1 */
#define PIO_PA26A_FLEXCOM9_FLEXCOM9_IO1            _UL_(_U_(1) << 26) /**< FLEXCOM9 signal: FLEXCOM9_FLEXCOM9_IO1 */
/* ========== PIO definition for GMAC peripheral ========== */
#define PIN_PC26B_GMAC_GCOL                        _L_(90)      /**< GMAC signal: GMAC_GCOL on PC26 mux B */
#define MUX_PC26B_GMAC_GCOL                        _L_(1)       /**< GMAC signal line function value: GMAC_GCOL */
#define PIO_PC26B_GMAC_GCOL                        _UL_(_U_(1) << 26) /**< GMAC signal: GMAC_GCOL */
#define PIN_PC27B_GMAC_GCRS                        _L_(91)      /**< GMAC signal: GMAC_GCRS on PC27 mux B */
#define MUX_PC27B_GMAC_GCRS                        _L_(1)       /**< GMAC signal line function value: GMAC_GCRS */
#define PIO_PC27B_GMAC_GCRS                        _UL_(_U_(1) << 27) /**< GMAC signal: GMAC_GCRS */
#define PIN_PC20B_GMAC_GMDC                        _L_(84)      /**< GMAC signal: GMAC_GMDC on PC20 mux B */
#define MUX_PC20B_GMAC_GMDC                        _L_(1)       /**< GMAC signal line function value: GMAC_GMDC */
#define PIO_PC20B_GMAC_GMDC                        _UL_(_U_(1) << 20) /**< GMAC signal: GMAC_GMDC */
#define PIN_PC19B_GMAC_GMDIO                       _L_(83)      /**< GMAC signal: GMAC_GMDIO on PC19 mux B */
#define MUX_PC19B_GMAC_GMDIO                       _L_(1)       /**< GMAC signal line function value: GMAC_GMDIO */
#define PIO_PC19B_GMAC_GMDIO                       _UL_(_U_(1) << 19) /**< GMAC signal: GMAC_GMDIO */
#define PIN_PC28B_GMAC_GRXCK                       _L_(92)      /**< GMAC signal: GMAC_GRXCK on PC28 mux B */
#define MUX_PC28B_GMAC_GRXCK                       _L_(1)       /**< GMAC signal line function value: GMAC_GRXCK */
#define PIO_PC28B_GMAC_GRXCK                       _UL_(_U_(1) << 28) /**< GMAC signal: GMAC_GRXCK */
#define PIN_PC16B_GMAC_GRXDV                       _L_(80)      /**< GMAC signal: GMAC_GRXDV on PC16 mux B */
#define MUX_PC16B_GMAC_GRXDV                       _L_(1)       /**< GMAC signal line function value: GMAC_GRXDV */
#define PIO_PC16B_GMAC_GRXDV                       _UL_(_U_(1) << 16) /**< GMAC signal: GMAC_GRXDV */
#define PIN_PC15B_GMAC_GRXER                       _L_(79)      /**< GMAC signal: GMAC_GRXER on PC15 mux B */
#define MUX_PC15B_GMAC_GRXER                       _L_(1)       /**< GMAC signal line function value: GMAC_GRXER */
#define PIO_PC15B_GMAC_GRXER                       _UL_(_U_(1) << 15) /**< GMAC signal: GMAC_GRXER */
#define PIN_PC12B_GMAC_GRX0                        _L_(76)      /**< GMAC signal: GMAC_GRX0 on PC12 mux B */
#define MUX_PC12B_GMAC_GRX0                        _L_(1)       /**< GMAC signal line function value: GMAC_GRX0 */
#define PIO_PC12B_GMAC_GRX0                        _UL_(_U_(1) << 12) /**< GMAC signal: GMAC_GRX0 */
#define PIN_PC11B_GMAC_GRX1                        _L_(75)      /**< GMAC signal: GMAC_GRX1 on PC11 mux B */
#define MUX_PC11B_GMAC_GRX1                        _L_(1)       /**< GMAC signal line function value: GMAC_GRX1 */
#define PIO_PC11B_GMAC_GRX1                        _UL_(_U_(1) << 11) /**< GMAC signal: GMAC_GRX1 */
#define PIN_PC30B_GMAC_GRX2                        _L_(94)      /**< GMAC signal: GMAC_GRX2 on PC30 mux B */
#define MUX_PC30B_GMAC_GRX2                        _L_(1)       /**< GMAC signal line function value: GMAC_GRX2 */
#define PIO_PC30B_GMAC_GRX2                        _UL_(_U_(1) << 30) /**< GMAC signal: GMAC_GRX2 */
#define PIN_PC29B_GMAC_GRX3                        _L_(93)      /**< GMAC signal: GMAC_GRX3 on PC29 mux B */
#define MUX_PC29B_GMAC_GRX3                        _L_(1)       /**< GMAC signal line function value: GMAC_GRX3 */
#define PIO_PC29B_GMAC_GRX3                        _UL_(_U_(1) << 29) /**< GMAC signal: GMAC_GRX3 */
#define PIN_PC31B_GMAC_GTSUCOMP                    _L_(95)      /**< GMAC signal: GMAC_GTSUCOMP on PC31 mux B */
#define MUX_PC31B_GMAC_GTSUCOMP                    _L_(1)       /**< GMAC signal line function value: GMAC_GTSUCOMP */
#define PIO_PC31B_GMAC_GTSUCOMP                    _UL_(_U_(1) << 31) /**< GMAC signal: GMAC_GTSUCOMP */
#define PIN_PC18B_GMAC_GTXCK                       _L_(82)      /**< GMAC signal: GMAC_GTXCK on PC18 mux B */
#define MUX_PC18B_GMAC_GTXCK                       _L_(1)       /**< GMAC signal line function value: GMAC_GTXCK */
#define PIO_PC18B_GMAC_GTXCK                       _UL_(_U_(1) << 18) /**< GMAC signal: GMAC_GTXCK */
#define PIN_PC17B_GMAC_GTXEN                       _L_(81)      /**< GMAC signal: GMAC_GTXEN on PC17 mux B */
#define MUX_PC17B_GMAC_GTXEN                       _L_(1)       /**< GMAC signal line function value: GMAC_GTXEN */
#define PIO_PC17B_GMAC_GTXEN                       _UL_(_U_(1) << 17) /**< GMAC signal: GMAC_GTXEN */
#define PIN_PC23B_GMAC_GTXER                       _L_(87)      /**< GMAC signal: GMAC_GTXER on PC23 mux B */
#define MUX_PC23B_GMAC_GTXER                       _L_(1)       /**< GMAC signal line function value: GMAC_GTXER */
#define PIO_PC23B_GMAC_GTXER                       _UL_(_U_(1) << 23) /**< GMAC signal: GMAC_GTXER */
#define PIN_PC14B_GMAC_GTX0                        _L_(78)      /**< GMAC signal: GMAC_GTX0 on PC14 mux B */
#define MUX_PC14B_GMAC_GTX0                        _L_(1)       /**< GMAC signal line function value: GMAC_GTX0 */
#define PIO_PC14B_GMAC_GTX0                        _UL_(_U_(1) << 14) /**< GMAC signal: GMAC_GTX0 */
#define PIN_PC13B_GMAC_GTX1                        _L_(77)      /**< GMAC signal: GMAC_GTX1 on PC13 mux B */
#define MUX_PC13B_GMAC_GTX1                        _L_(1)       /**< GMAC signal line function value: GMAC_GTX1 */
#define PIO_PC13B_GMAC_GTX1                        _UL_(_U_(1) << 13) /**< GMAC signal: GMAC_GTX1 */
#define PIN_PC24B_GMAC_GTX2                        _L_(88)      /**< GMAC signal: GMAC_GTX2 on PC24 mux B */
#define MUX_PC24B_GMAC_GTX2                        _L_(1)       /**< GMAC signal line function value: GMAC_GTX2 */
#define PIO_PC24B_GMAC_GTX2                        _UL_(_U_(1) << 24) /**< GMAC signal: GMAC_GTX2 */
#define PIN_PC25B_GMAC_GTX3                        _L_(89)      /**< GMAC signal: GMAC_GTX3 on PC25 mux B */
#define MUX_PC25B_GMAC_GTX3                        _L_(1)       /**< GMAC signal line function value: GMAC_GTX3 */
#define PIO_PC25B_GMAC_GTX3                        _UL_(_U_(1) << 25) /**< GMAC signal: GMAC_GTX3 */
/* ========== PIO definition for HEMC peripheral ========== */
#define PIN_PG0A_HEMC_A0                           _L_(192)     /**< HEMC signal: HEMC_A0 on PG0 mux A */
#define MUX_PG0A_HEMC_A0                           _L_(0)       /**< HEMC signal line function value: HEMC_A0 */
