Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/pio/samrh71f20b.h
#define PIN_PD25A_HEMC_D25                         _L_(121)     /**< HEMC signal: HEMC_D25 on PD25 mux A */
#define MUX_PD25A_HEMC_D25                         _L_(0)       /**< HEMC signal line function value: HEMC_D25 */
#define PIO_PD25A_HEMC_D25                         _UL_(_U_(1) << 25) /**< HEMC signal: HEMC_D25 */
#define PIN_PD26A_HEMC_D26                         _L_(122)     /**< HEMC signal: HEMC_D26 on PD26 mux A */
#define MUX_PD26A_HEMC_D26                         _L_(0)       /**< HEMC signal line function value: HEMC_D26 */
#define PIO_PD26A_HEMC_D26                         _UL_(_U_(1) << 26) /**< HEMC signal: HEMC_D26 */
#define PIN_PD27A_HEMC_D27                         _L_(123)     /**< HEMC signal: HEMC_D27 on PD27 mux A */
#define MUX_PD27A_HEMC_D27                         _L_(0)       /**< HEMC signal line function value: HEMC_D27 */
#define PIO_PD27A_HEMC_D27                         _UL_(_U_(1) << 27) /**< HEMC signal: HEMC_D27 */
#define PIN_PD28A_HEMC_D28                         _L_(124)     /**< HEMC signal: HEMC_D28 on PD28 mux A */
#define MUX_PD28A_HEMC_D28                         _L_(0)       /**< HEMC signal line function value: HEMC_D28 */
#define PIO_PD28A_HEMC_D28                         _UL_(_U_(1) << 28) /**< HEMC signal: HEMC_D28 */
#define PIN_PD29A_HEMC_D29                         _L_(125)     /**< HEMC signal: HEMC_D29 on PD29 mux A */
#define MUX_PD29A_HEMC_D29                         _L_(0)       /**< HEMC signal line function value: HEMC_D29 */
#define PIO_PD29A_HEMC_D29                         _UL_(_U_(1) << 29) /**< HEMC signal: HEMC_D29 */
#define PIN_PD30A_HEMC_D30                         _L_(126)     /**< HEMC signal: HEMC_D30 on PD30 mux A */
#define MUX_PD30A_HEMC_D30                         _L_(0)       /**< HEMC signal line function value: HEMC_D30 */
#define PIO_PD30A_HEMC_D30                         _UL_(_U_(1) << 30) /**< HEMC signal: HEMC_D30 */
#define PIN_PD31A_HEMC_D31                         _L_(127)     /**< HEMC signal: HEMC_D31 on PD31 mux A */
#define MUX_PD31A_HEMC_D31                         _L_(0)       /**< HEMC signal line function value: HEMC_D31 */
#define PIO_PD31A_HEMC_D31                         _UL_(_U_(1) << 31) /**< HEMC signal: HEMC_D31 */
#define PIN_PF25A_HEMC_EXT_CTRL_BUFFER             _L_(185)     /**< HEMC signal: HEMC_EXT_CTRL_BUFFER on PF25 mux A */
#define MUX_PF25A_HEMC_EXT_CTRL_BUFFER             _L_(0)       /**< HEMC signal line function value: HEMC_EXT_CTRL_BUFFER */
#define PIO_PF25A_HEMC_EXT_CTRL_BUFFER             _UL_(_U_(1) << 25) /**< HEMC signal: HEMC_EXT_CTRL_BUFFER */
#define PIN_PF11A_HEMC_NCS0                        _L_(171)     /**< HEMC signal: HEMC_NCS0 on PF11 mux A */
#define MUX_PF11A_HEMC_NCS0                        _L_(0)       /**< HEMC signal line function value: HEMC_NCS0 */
#define PIO_PF11A_HEMC_NCS0                        _UL_(_U_(1) << 11) /**< HEMC signal: HEMC_NCS0 */
#define PIN_PF12A_HEMC_NCS1                        _L_(172)     /**< HEMC signal: HEMC_NCS1 on PF12 mux A */
#define MUX_PF12A_HEMC_NCS1                        _L_(0)       /**< HEMC signal line function value: HEMC_NCS1 */
#define PIO_PF12A_HEMC_NCS1                        _UL_(_U_(1) << 12) /**< HEMC signal: HEMC_NCS1 */
#define PIN_PF13A_HEMC_NCS2                        _L_(173)     /**< HEMC signal: HEMC_NCS2 on PF13 mux A */
#define MUX_PF13A_HEMC_NCS2                        _L_(0)       /**< HEMC signal line function value: HEMC_NCS2 */
#define PIO_PF13A_HEMC_NCS2                        _UL_(_U_(1) << 13) /**< HEMC signal: HEMC_NCS2 */
#define PIN_PF14A_HEMC_NCS3                        _L_(174)     /**< HEMC signal: HEMC_NCS3 on PF14 mux A */
#define MUX_PF14A_HEMC_NCS3                        _L_(0)       /**< HEMC signal line function value: HEMC_NCS3 */
#define PIO_PF14A_HEMC_NCS3                        _UL_(_U_(1) << 14) /**< HEMC signal: HEMC_NCS3 */
#define PIN_PF15A_HEMC_NCS4                        _L_(175)     /**< HEMC signal: HEMC_NCS4 on PF15 mux A */
#define MUX_PF15A_HEMC_NCS4                        _L_(0)       /**< HEMC signal line function value: HEMC_NCS4 */
#define PIO_PF15A_HEMC_NCS4                        _UL_(_U_(1) << 15) /**< HEMC signal: HEMC_NCS4 */
#define PIN_PF16A_HEMC_NCS5                        _L_(176)     /**< HEMC signal: HEMC_NCS5 on PF16 mux A */
#define MUX_PF16A_HEMC_NCS5                        _L_(0)       /**< HEMC signal line function value: HEMC_NCS5 */
#define PIO_PF16A_HEMC_NCS5                        _UL_(_U_(1) << 16) /**< HEMC signal: HEMC_NCS5 */
#define PIN_PF17A_HEMC_NRD                         _L_(177)     /**< HEMC signal: HEMC_NRD on PF17 mux A */
#define MUX_PF17A_HEMC_NRD                         _L_(0)       /**< HEMC signal line function value: HEMC_NRD */
#define PIO_PF17A_HEMC_NRD                         _UL_(_U_(1) << 17) /**< HEMC signal: HEMC_NRD */
#define PIN_PF24A_HEMC_NWAIT                       _L_(184)     /**< HEMC signal: HEMC_NWAIT on PF24 mux A */
#define MUX_PF24A_HEMC_NWAIT                       _L_(0)       /**< HEMC signal line function value: HEMC_NWAIT */
#define PIO_PF24A_HEMC_NWAIT                       _UL_(_U_(1) << 24) /**< HEMC signal: HEMC_NWAIT */
#define PIN_PF18A_HEMC_NWE                         _L_(178)     /**< HEMC signal: HEMC_NWE on PF18 mux A */
#define MUX_PF18A_HEMC_NWE                         _L_(0)       /**< HEMC signal line function value: HEMC_NWE */
#define PIO_PF18A_HEMC_NWE                         _UL_(_U_(1) << 18) /**< HEMC signal: HEMC_NWE */
#define PIN_PF19A_HEMC_NWR0                        _L_(179)     /**< HEMC signal: HEMC_NWR0 on PF19 mux A */
#define MUX_PF19A_HEMC_NWR0                        _L_(0)       /**< HEMC signal line function value: HEMC_NWR0 */
#define PIO_PF19A_HEMC_NWR0                        _UL_(_U_(1) << 19) /**< HEMC signal: HEMC_NWR0 */
#define PIN_PF20A_HEMC_NWR1                        _L_(180)     /**< HEMC signal: HEMC_NWR1 on PF20 mux A */
#define MUX_PF20A_HEMC_NWR1                        _L_(0)       /**< HEMC signal line function value: HEMC_NWR1 */
#define PIO_PF20A_HEMC_NWR1                        _UL_(_U_(1) << 20) /**< HEMC signal: HEMC_NWR1 */
#define PIN_PF21A_HEMC_NWR2                        _L_(181)     /**< HEMC signal: HEMC_NWR2 on PF21 mux A */
#define MUX_PF21A_HEMC_NWR2                        _L_(0)       /**< HEMC signal line function value: HEMC_NWR2 */
#define PIO_PF21A_HEMC_NWR2                        _UL_(_U_(1) << 21) /**< HEMC signal: HEMC_NWR2 */
#define PIN_PF22A_HEMC_NWR3                        _L_(182)     /**< HEMC signal: HEMC_NWR3 on PF22 mux A */
#define MUX_PF22A_HEMC_NWR3                        _L_(0)       /**< HEMC signal line function value: HEMC_NWR3 */
#define PIO_PF22A_HEMC_NWR3                        _UL_(_U_(1) << 22) /**< HEMC signal: HEMC_NWR3 */
#define PIN_PF23A_HEMC_NWR4                        _L_(183)     /**< HEMC signal: HEMC_NWR4 on PF23 mux A */
#define MUX_PF23A_HEMC_NWR4                        _L_(0)       /**< HEMC signal line function value: HEMC_NWR4 */
#define PIO_PF23A_HEMC_NWR4                        _UL_(_U_(1) << 23) /**< HEMC signal: HEMC_NWR4 */
#define PIN_PF0A_HEMC_RAS                          _L_(160)     /**< HEMC signal: HEMC_RAS on PF0 mux A */
#define MUX_PF0A_HEMC_RAS                          _L_(0)       /**< HEMC signal line function value: HEMC_RAS */
#define PIO_PF0A_HEMC_RAS                          _UL_(_U_(1) << 0) /**< HEMC signal: HEMC_RAS */
#define PIN_PF1A_HEMC_SDA10                        _L_(161)     /**< HEMC signal: HEMC_SDA10 on PF1 mux A */
#define MUX_PF1A_HEMC_SDA10                        _L_(0)       /**< HEMC signal line function value: HEMC_SDA10 */
#define PIO_PF1A_HEMC_SDA10                        _UL_(_U_(1) << 1) /**< HEMC signal: HEMC_SDA10 */
#define PIN_PF2A_HEMC_SDCK                         _L_(162)     /**< HEMC signal: HEMC_SDCK on PF2 mux A */
#define MUX_PF2A_HEMC_SDCK                         _L_(0)       /**< HEMC signal line function value: HEMC_SDCK */
#define PIO_PF2A_HEMC_SDCK                         _UL_(_U_(1) << 2) /**< HEMC signal: HEMC_SDCK */
#define PIN_PF3A_HEMC_SDCKE                        _L_(163)     /**< HEMC signal: HEMC_SDCKE on PF3 mux A */
#define MUX_PF3A_HEMC_SDCKE                        _L_(0)       /**< HEMC signal line function value: HEMC_SDCKE */
#define PIO_PF3A_HEMC_SDCKE                        _UL_(_U_(1) << 3) /**< HEMC signal: HEMC_SDCKE */
#define PIN_PF4A_HEMC_SDNBS0                       _L_(164)     /**< HEMC signal: HEMC_SDNBS0 on PF4 mux A */
#define MUX_PF4A_HEMC_SDNBS0                       _L_(0)       /**< HEMC signal line function value: HEMC_SDNBS0 */
#define PIO_PF4A_HEMC_SDNBS0                       _UL_(_U_(1) << 4) /**< HEMC signal: HEMC_SDNBS0 */
#define PIN_PF5A_HEMC_SDNBS1                       _L_(165)     /**< HEMC signal: HEMC_SDNBS1 on PF5 mux A */
#define MUX_PF5A_HEMC_SDNBS1                       _L_(0)       /**< HEMC signal line function value: HEMC_SDNBS1 */
#define PIO_PF5A_HEMC_SDNBS1                       _UL_(_U_(1) << 5) /**< HEMC signal: HEMC_SDNBS1 */
#define PIN_PF6A_HEMC_SDNBS2                       _L_(166)     /**< HEMC signal: HEMC_SDNBS2 on PF6 mux A */
#define MUX_PF6A_HEMC_SDNBS2                       _L_(0)       /**< HEMC signal line function value: HEMC_SDNBS2 */
#define PIO_PF6A_HEMC_SDNBS2                       _UL_(_U_(1) << 6) /**< HEMC signal: HEMC_SDNBS2 */
#define PIN_PF7A_HEMC_SDNBS3                       _L_(167)     /**< HEMC signal: HEMC_SDNBS3 on PF7 mux A */
#define MUX_PF7A_HEMC_SDNBS3                       _L_(0)       /**< HEMC signal line function value: HEMC_SDNBS3 */
#define PIO_PF7A_HEMC_SDNBS3                       _UL_(_U_(1) << 7) /**< HEMC signal: HEMC_SDNBS3 */
#define PIN_PF8A_HEMC_SDNBS4                       _L_(168)     /**< HEMC signal: HEMC_SDNBS4 on PF8 mux A */
#define MUX_PF8A_HEMC_SDNBS4                       _L_(0)       /**< HEMC signal line function value: HEMC_SDNBS4 */
#define PIO_PF8A_HEMC_SDNBS4                       _UL_(_U_(1) << 8) /**< HEMC signal: HEMC_SDNBS4 */
#define PIN_PF9A_HEMC_SDWE                         _L_(169)     /**< HEMC signal: HEMC_SDWE on PF9 mux A */
#define MUX_PF9A_HEMC_SDWE                         _L_(0)       /**< HEMC signal line function value: HEMC_SDWE */
#define PIO_PF9A_HEMC_SDWE                         _UL_(_U_(1) << 9) /**< HEMC signal: HEMC_SDWE */
/* ========== PIO definition for MCAN0 peripheral ========== */
#define PIN_PB7C_MCAN0_CANRX0                      _L_(39)      /**< MCAN0 signal: MCAN0_CANRX0 on PB7 mux C */
#define MUX_PB7C_MCAN0_CANRX0                      _L_(2)       /**< MCAN0 signal line function value: MCAN0_CANRX0 */
#define PIO_PB7C_MCAN0_CANRX0                      _UL_(_U_(1) << 7) /**< MCAN0 signal: MCAN0_CANRX0 */
#define PIN_PE8C_MCAN0_CANRX0                      _L_(136)     /**< MCAN0 signal: MCAN0_CANRX0 on PE8 mux C */
#define MUX_PE8C_MCAN0_CANRX0                      _L_(2)       /**< MCAN0 signal line function value: MCAN0_CANRX0 */
#define PIO_PE8C_MCAN0_CANRX0                      _UL_(_U_(1) << 8) /**< MCAN0 signal: MCAN0_CANRX0 */
#define PIN_PB6C_MCAN0_CANTX0                      _L_(38)      /**< MCAN0 signal: MCAN0_CANTX0 on PB6 mux C */
#define MUX_PB6C_MCAN0_CANTX0                      _L_(2)       /**< MCAN0 signal line function value: MCAN0_CANTX0 */
#define PIO_PB6C_MCAN0_CANTX0                      _UL_(_U_(1) << 6) /**< MCAN0 signal: MCAN0_CANTX0 */
#define PIN_PE9C_MCAN0_CANTX0                      _L_(137)     /**< MCAN0 signal: MCAN0_CANTX0 on PE9 mux C */
#define MUX_PE9C_MCAN0_CANTX0                      _L_(2)       /**< MCAN0 signal line function value: MCAN0_CANTX0 */
#define PIO_PE9C_MCAN0_CANTX0                      _UL_(_U_(1) << 9) /**< MCAN0 signal: MCAN0_CANTX0 */
/* ========== PIO definition for MCAN1 peripheral ========== */
#define PIN_PB5C_MCAN1_CANRX1                      _L_(37)      /**< MCAN1 signal: MCAN1_CANRX1 on PB5 mux C */
#define MUX_PB5C_MCAN1_CANRX1                      _L_(2)       /**< MCAN1 signal line function value: MCAN1_CANRX1 */
#define PIO_PB5C_MCAN1_CANRX1                      _UL_(_U_(1) << 5) /**< MCAN1 signal: MCAN1_CANRX1 */
#define PIN_PE10C_MCAN1_CANRX1                     _L_(138)     /**< MCAN1 signal: MCAN1_CANRX1 on PE10 mux C */
#define MUX_PE10C_MCAN1_CANRX1                     _L_(2)       /**< MCAN1 signal line function value: MCAN1_CANRX1 */
#define PIO_PE10C_MCAN1_CANRX1                     _UL_(_U_(1) << 10) /**< MCAN1 signal: MCAN1_CANRX1 */
#define PIN_PB4C_MCAN1_CANTX1                      _L_(36)      /**< MCAN1 signal: MCAN1_CANTX1 on PB4 mux C */
#define MUX_PB4C_MCAN1_CANTX1                      _L_(2)       /**< MCAN1 signal line function value: MCAN1_CANTX1 */
#define PIO_PB4C_MCAN1_CANTX1                      _UL_(_U_(1) << 4) /**< MCAN1 signal: MCAN1_CANTX1 */
#define PIN_PE11C_MCAN1_CANTX1                     _L_(139)     /**< MCAN1 signal: MCAN1_CANTX1 on PE11 mux C */
#define MUX_PE11C_MCAN1_CANTX1                     _L_(2)       /**< MCAN1 signal line function value: MCAN1_CANTX1 */
#define PIO_PE11C_MCAN1_CANTX1                     _UL_(_U_(1) << 11) /**< MCAN1 signal: MCAN1_CANTX1 */
/* ========== PIO definition for PMC peripheral ========== */
#define PIN_PA11B_PMC_PCK0                         _L_(11)      /**< PMC signal: PMC_PCK0 on PA11 mux B */
#define MUX_PA11B_PMC_PCK0                         _L_(1)       /**< PMC signal line function value: PMC_PCK0 */
#define PIO_PA11B_PMC_PCK0                         _UL_(_U_(1) << 11) /**< PMC signal: PMC_PCK0 */
#define PIN_PC7A_PMC_PCK0                          _L_(71)      /**< PMC signal: PMC_PCK0 on PC7 mux A */
#define MUX_PC7A_PMC_PCK0                          _L_(0)       /**< PMC signal line function value: PMC_PCK0 */
#define PIO_PC7A_PMC_PCK0                          _UL_(_U_(1) << 7) /**< PMC signal: PMC_PCK0 */
#define PIN_PC8A_PMC_PCK1                          _L_(72)      /**< PMC signal: PMC_PCK1 on PC8 mux A */
#define MUX_PC8A_PMC_PCK1                          _L_(0)       /**< PMC signal line function value: PMC_PCK1 */
#define PIO_PC8A_PMC_PCK1                          _UL_(_U_(1) << 8) /**< PMC signal: PMC_PCK1 */
#define PIN_PE12B_PMC_PCK1                         _L_(140)     /**< PMC signal: PMC_PCK1 on PE12 mux B */
#define MUX_PE12B_PMC_PCK1                         _L_(1)       /**< PMC signal line function value: PMC_PCK1 */
#define PIO_PE12B_PMC_PCK1                         _UL_(_U_(1) << 12) /**< PMC signal: PMC_PCK1 */
#define PIN_PA10B_PMC_PCK2                         _L_(10)      /**< PMC signal: PMC_PCK2 on PA10 mux B */
#define MUX_PA10B_PMC_PCK2                         _L_(1)       /**< PMC signal line function value: PMC_PCK2 */
#define PIO_PA10B_PMC_PCK2                         _UL_(_U_(1) << 10) /**< PMC signal: PMC_PCK2 */
/* ========== PIO definition for PWM0 peripheral ========== */
#define PIN_PA10C_PWM0_PWMC0_PWMEXTRG0             _L_(10)      /**< PWM0 signal: PWM0_PWMC0_PWMEXTRG0 on PA10 mux C */
#define MUX_PA10C_PWM0_PWMC0_PWMEXTRG0             _L_(2)       /**< PWM0 signal line function value: PWM0_PWMC0_PWMEXTRG0 */
#define PIO_PA10C_PWM0_PWMC0_PWMEXTRG0             _UL_(_U_(1) << 10) /**< PWM0 signal: PWM0_PWMC0_PWMEXTRG0 */
#define PIN_PA11C_PWM0_PWMC0_PWMEXTRG1             _L_(11)      /**< PWM0 signal: PWM0_PWMC0_PWMEXTRG1 on PA11 mux C */
#define MUX_PA11C_PWM0_PWMC0_PWMEXTRG1             _L_(2)       /**< PWM0 signal line function value: PWM0_PWMC0_PWMEXTRG1 */
#define PIO_PA11C_PWM0_PWMC0_PWMEXTRG1             _UL_(_U_(1) << 11) /**< PWM0 signal: PWM0_PWMC0_PWMEXTRG1 */
#define PIN_PA8C_PWM0_PWMC0_PWMFI0                 _L_(8)       /**< PWM0 signal: PWM0_PWMC0_PWMFI0 on PA8 mux C */
#define MUX_PA8C_PWM0_PWMC0_PWMFI0                 _L_(2)       /**< PWM0 signal line function value: PWM0_PWMC0_PWMFI0 */
#define PIO_PA8C_PWM0_PWMC0_PWMFI0                 _UL_(_U_(1) << 8) /**< PWM0 signal: PWM0_PWMC0_PWMFI0 */
#define PIN_PA9C_PWM0_PWMC0_PWMFI1                 _L_(9)       /**< PWM0 signal: PWM0_PWMC0_PWMFI1 on PA9 mux C */
#define MUX_PA9C_PWM0_PWMC0_PWMFI1                 _L_(2)       /**< PWM0 signal line function value: PWM0_PWMC0_PWMFI1 */
#define PIO_PA9C_PWM0_PWMC0_PWMFI1                 _UL_(_U_(1) << 9) /**< PWM0 signal: PWM0_PWMC0_PWMFI1 */
#define PIN_PA12C_PWM0_PWMC0_PWMFI2                _L_(12)      /**< PWM0 signal: PWM0_PWMC0_PWMFI2 on PA12 mux C */
#define MUX_PA12C_PWM0_PWMC0_PWMFI2                _L_(2)       /**< PWM0 signal line function value: PWM0_PWMC0_PWMFI2 */
#define PIO_PA12C_PWM0_PWMC0_PWMFI2                _UL_(_U_(1) << 12) /**< PWM0 signal: PWM0_PWMC0_PWMFI2 */
#define PIN_PA0C_PWM0_PWMC0_PWMH0                  _L_(0)       /**< PWM0 signal: PWM0_PWMC0_PWMH0 on PA0 mux C */
#define MUX_PA0C_PWM0_PWMC0_PWMH0                  _L_(2)       /**< PWM0 signal line function value: PWM0_PWMC0_PWMH0 */
#define PIO_PA0C_PWM0_PWMC0_PWMH0                  _UL_(_U_(1) << 0) /**< PWM0 signal: PWM0_PWMC0_PWMH0 */
#define PIN_PA1C_PWM0_PWMC0_PWMH1                  _L_(1)       /**< PWM0 signal: PWM0_PWMC0_PWMH1 on PA1 mux C */
#define MUX_PA1C_PWM0_PWMC0_PWMH1                  _L_(2)       /**< PWM0 signal line function value: PWM0_PWMC0_PWMH1 */
#define PIO_PA1C_PWM0_PWMC0_PWMH1                  _UL_(_U_(1) << 1) /**< PWM0 signal: PWM0_PWMC0_PWMH1 */
#define PIN_PA2C_PWM0_PWMC0_PWMH2                  _L_(2)       /**< PWM0 signal: PWM0_PWMC0_PWMH2 on PA2 mux C */
#define MUX_PA2C_PWM0_PWMC0_PWMH2                  _L_(2)       /**< PWM0 signal line function value: PWM0_PWMC0_PWMH2 */
#define PIO_PA2C_PWM0_PWMC0_PWMH2                  _UL_(_U_(1) << 2) /**< PWM0 signal: PWM0_PWMC0_PWMH2 */
#define PIN_PA3C_PWM0_PWMC0_PWMH3                  _L_(3)       /**< PWM0 signal: PWM0_PWMC0_PWMH3 on PA3 mux C */
#define MUX_PA3C_PWM0_PWMC0_PWMH3                  _L_(2)       /**< PWM0 signal line function value: PWM0_PWMC0_PWMH3 */
#define PIO_PA3C_PWM0_PWMC0_PWMH3                  _UL_(_U_(1) << 3) /**< PWM0 signal: PWM0_PWMC0_PWMH3 */
#define PIN_PA4C_PWM0_PWMC0_PWML0                  _L_(4)       /**< PWM0 signal: PWM0_PWMC0_PWML0 on PA4 mux C */
#define MUX_PA4C_PWM0_PWMC0_PWML0                  _L_(2)       /**< PWM0 signal line function value: PWM0_PWMC0_PWML0 */
#define PIO_PA4C_PWM0_PWMC0_PWML0                  _UL_(_U_(1) << 4) /**< PWM0 signal: PWM0_PWMC0_PWML0 */
#define PIN_PA5C_PWM0_PWMC0_PWML1                  _L_(5)       /**< PWM0 signal: PWM0_PWMC0_PWML1 on PA5 mux C */
#define MUX_PA5C_PWM0_PWMC0_PWML1                  _L_(2)       /**< PWM0 signal line function value: PWM0_PWMC0_PWML1 */
#define PIO_PA5C_PWM0_PWMC0_PWML1                  _UL_(_U_(1) << 5) /**< PWM0 signal: PWM0_PWMC0_PWML1 */
#define PIN_PA6C_PWM0_PWMC0_PWML2                  _L_(6)       /**< PWM0 signal: PWM0_PWMC0_PWML2 on PA6 mux C */
#define MUX_PA6C_PWM0_PWMC0_PWML2                  _L_(2)       /**< PWM0 signal line function value: PWM0_PWMC0_PWML2 */
#define PIO_PA6C_PWM0_PWMC0_PWML2                  _UL_(_U_(1) << 6) /**< PWM0 signal: PWM0_PWMC0_PWML2 */
#define PIN_PA7C_PWM0_PWMC0_PWML3                  _L_(7)       /**< PWM0 signal: PWM0_PWMC0_PWML3 on PA7 mux C */
#define MUX_PA7C_PWM0_PWMC0_PWML3                  _L_(2)       /**< PWM0 signal line function value: PWM0_PWMC0_PWML3 */
#define PIO_PA7C_PWM0_PWMC0_PWML3                  _UL_(_U_(1) << 7) /**< PWM0 signal: PWM0_PWMC0_PWML3 */
/* ========== PIO definition for PWM1 peripheral ========== */
#define PIN_PB17A_PWM1_PWMC1_PWMEXTRG0             _L_(49)      /**< PWM1 signal: PWM1_PWMC1_PWMEXTRG0 on PB17 mux A */
#define MUX_PB17A_PWM1_PWMC1_PWMEXTRG0             _L_(0)       /**< PWM1 signal line function value: PWM1_PWMC1_PWMEXTRG0 */
#define PIO_PB17A_PWM1_PWMC1_PWMEXTRG0             _UL_(_U_(1) << 17) /**< PWM1 signal: PWM1_PWMC1_PWMEXTRG0 */
#define PIN_PB18A_PWM1_PWMC1_PWMEXTRG1             _L_(50)      /**< PWM1 signal: PWM1_PWMC1_PWMEXTRG1 on PB18 mux A */
#define MUX_PB18A_PWM1_PWMC1_PWMEXTRG1             _L_(0)       /**< PWM1 signal line function value: PWM1_PWMC1_PWMEXTRG1 */
#define PIO_PB18A_PWM1_PWMC1_PWMEXTRG1             _UL_(_U_(1) << 18) /**< PWM1 signal: PWM1_PWMC1_PWMEXTRG1 */
#define PIN_PB27A_PWM1_PWMC1_PWMFI0                _L_(59)      /**< PWM1 signal: PWM1_PWMC1_PWMFI0 on PB27 mux A */
#define MUX_PB27A_PWM1_PWMC1_PWMFI0                _L_(0)       /**< PWM1 signal line function value: PWM1_PWMC1_PWMFI0 */
#define PIO_PB27A_PWM1_PWMC1_PWMFI0                _UL_(_U_(1) << 27) /**< PWM1 signal: PWM1_PWMC1_PWMFI0 */
#define PIN_PB28A_PWM1_PWMC1_PWMFI1                _L_(60)      /**< PWM1 signal: PWM1_PWMC1_PWMFI1 on PB28 mux A */
#define MUX_PB28A_PWM1_PWMC1_PWMFI1                _L_(0)       /**< PWM1 signal line function value: PWM1_PWMC1_PWMFI1 */
#define PIO_PB28A_PWM1_PWMC1_PWMFI1                _UL_(_U_(1) << 28) /**< PWM1 signal: PWM1_PWMC1_PWMFI1 */
#define PIN_PB29A_PWM1_PWMC1_PWMFI2                _L_(61)      /**< PWM1 signal: PWM1_PWMC1_PWMFI2 on PB29 mux A */
#define MUX_PB29A_PWM1_PWMC1_PWMFI2                _L_(0)       /**< PWM1 signal line function value: PWM1_PWMC1_PWMFI2 */
#define PIO_PB29A_PWM1_PWMC1_PWMFI2                _UL_(_U_(1) << 29) /**< PWM1 signal: PWM1_PWMC1_PWMFI2 */
#define PIN_PB19A_PWM1_PWMC1_PWMH0                 _L_(51)      /**< PWM1 signal: PWM1_PWMC1_PWMH0 on PB19 mux A */
#define MUX_PB19A_PWM1_PWMC1_PWMH0                 _L_(0)       /**< PWM1 signal line function value: PWM1_PWMC1_PWMH0 */
#define PIO_PB19A_PWM1_PWMC1_PWMH0                 _UL_(_U_(1) << 19) /**< PWM1 signal: PWM1_PWMC1_PWMH0 */
#define PIN_PB20A_PWM1_PWMC1_PWMH1                 _L_(52)      /**< PWM1 signal: PWM1_PWMC1_PWMH1 on PB20 mux A */
#define MUX_PB20A_PWM1_PWMC1_PWMH1                 _L_(0)       /**< PWM1 signal line function value: PWM1_PWMC1_PWMH1 */
#define PIO_PB20A_PWM1_PWMC1_PWMH1                 _UL_(_U_(1) << 20) /**< PWM1 signal: PWM1_PWMC1_PWMH1 */
#define PIN_PB21A_PWM1_PWMC1_PWMH2                 _L_(53)      /**< PWM1 signal: PWM1_PWMC1_PWMH2 on PB21 mux A */
#define MUX_PB21A_PWM1_PWMC1_PWMH2                 _L_(0)       /**< PWM1 signal line function value: PWM1_PWMC1_PWMH2 */
#define PIO_PB21A_PWM1_PWMC1_PWMH2                 _UL_(_U_(1) << 21) /**< PWM1 signal: PWM1_PWMC1_PWMH2 */
#define PIN_PB22A_PWM1_PWMC1_PWMH3                 _L_(54)      /**< PWM1 signal: PWM1_PWMC1_PWMH3 on PB22 mux A */
#define MUX_PB22A_PWM1_PWMC1_PWMH3                 _L_(0)       /**< PWM1 signal line function value: PWM1_PWMC1_PWMH3 */
#define PIO_PB22A_PWM1_PWMC1_PWMH3                 _UL_(_U_(1) << 22) /**< PWM1 signal: PWM1_PWMC1_PWMH3 */
#define PIN_PB23A_PWM1_PWMC1_PWML0                 _L_(55)      /**< PWM1 signal: PWM1_PWMC1_PWML0 on PB23 mux A */
#define MUX_PB23A_PWM1_PWMC1_PWML0                 _L_(0)       /**< PWM1 signal line function value: PWM1_PWMC1_PWML0 */
#define PIO_PB23A_PWM1_PWMC1_PWML0                 _UL_(_U_(1) << 23) /**< PWM1 signal: PWM1_PWMC1_PWML0 */
#define PIN_PB24A_PWM1_PWMC1_PWML1                 _L_(56)      /**< PWM1 signal: PWM1_PWMC1_PWML1 on PB24 mux A */
#define MUX_PB24A_PWM1_PWMC1_PWML1                 _L_(0)       /**< PWM1 signal line function value: PWM1_PWMC1_PWML1 */
#define PIO_PB24A_PWM1_PWMC1_PWML1                 _UL_(_U_(1) << 24) /**< PWM1 signal: PWM1_PWMC1_PWML1 */
#define PIN_PB25A_PWM1_PWMC1_PWML2                 _L_(57)      /**< PWM1 signal: PWM1_PWMC1_PWML2 on PB25 mux A */
#define MUX_PB25A_PWM1_PWMC1_PWML2                 _L_(0)       /**< PWM1 signal line function value: PWM1_PWMC1_PWML2 */
#define PIO_PB25A_PWM1_PWMC1_PWML2                 _UL_(_U_(1) << 25) /**< PWM1 signal: PWM1_PWMC1_PWML2 */
#define PIN_PB26A_PWM1_PWMC1_PWML3                 _L_(58)      /**< PWM1 signal: PWM1_PWMC1_PWML3 on PB26 mux A */
#define MUX_PB26A_PWM1_PWMC1_PWML3                 _L_(0)       /**< PWM1 signal line function value: PWM1_PWMC1_PWML3 */
