Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/pio/samrh71f20b.h
#define PIO_PB26A_PWM1_PWMC1_PWML3                 _UL_(_U_(1) << 26) /**< PWM1 signal: PWM1_PWMC1_PWML3 */
/* ========== PIO definition for QSPI peripheral ========== */
#define PIN_PA22C_QSPI_QCS                         _L_(22)      /**< QSPI signal: QSPI_QCS on PA22 mux C */
#define MUX_PA22C_QSPI_QCS                         _L_(2)       /**< QSPI signal line function value: QSPI_QCS */
#define PIO_PA22C_QSPI_QCS                         _UL_(_U_(1) << 22) /**< QSPI signal: QSPI_QCS */
#define PIN_PA24C_QSPI_QIO0                        _L_(24)      /**< QSPI signal: QSPI_QIO0 on PA24 mux C */
#define MUX_PA24C_QSPI_QIO0                        _L_(2)       /**< QSPI signal line function value: QSPI_QIO0 */
#define PIO_PA24C_QSPI_QIO0                        _UL_(_U_(1) << 24) /**< QSPI signal: QSPI_QIO0 */
#define PIN_PA23C_QSPI_QIO1                        _L_(23)      /**< QSPI signal: QSPI_QIO1 on PA23 mux C */
#define MUX_PA23C_QSPI_QIO1                        _L_(2)       /**< QSPI signal line function value: QSPI_QIO1 */
#define PIO_PA23C_QSPI_QIO1                        _UL_(_U_(1) << 23) /**< QSPI signal: QSPI_QIO1 */
#define PIN_PA20C_QSPI_QIO2                        _L_(20)      /**< QSPI signal: QSPI_QIO2 on PA20 mux C */
#define MUX_PA20C_QSPI_QIO2                        _L_(2)       /**< QSPI signal line function value: QSPI_QIO2 */
#define PIO_PA20C_QSPI_QIO2                        _UL_(_U_(1) << 20) /**< QSPI signal: QSPI_QIO2 */
#define PIN_PA19C_QSPI_QIO3                        _L_(19)      /**< QSPI signal: QSPI_QIO3 on PA19 mux C */
#define MUX_PA19C_QSPI_QIO3                        _L_(2)       /**< QSPI signal line function value: QSPI_QIO3 */
#define PIO_PA19C_QSPI_QIO3                        _UL_(_U_(1) << 19) /**< QSPI signal: QSPI_QIO3 */
#define PIN_PA21C_QSPI_QSCK                        _L_(21)      /**< QSPI signal: QSPI_QSCK on PA21 mux C */
#define MUX_PA21C_QSPI_QSCK                        _L_(2)       /**< QSPI signal line function value: QSPI_QSCK */
#define PIO_PA21C_QSPI_QSCK                        _UL_(_U_(1) << 21) /**< QSPI signal: QSPI_QSCK */
/* ========== PIO definition for RTC peripheral ========== */
#define PIN_PG30A_RTC_RTCOUT0                      _L_(222)     /**< RTC signal: RTC_RTCOUT0 on PG30 mux A */
#define MUX_PG30A_RTC_RTCOUT0                      _L_(0)       /**< RTC signal line function value: RTC_RTCOUT0 */
#define PIO_PG30A_RTC_RTCOUT0                      _UL_(_U_(1) << 30) /**< RTC signal: RTC_RTCOUT0 */
#define PIN_PG31A_RTC_RTCOUT1                      _L_(223)     /**< RTC signal: RTC_RTCOUT1 on PG31 mux A */
#define MUX_PG31A_RTC_RTCOUT1                      _L_(0)       /**< RTC signal line function value: RTC_RTCOUT1 */
#define PIO_PG31A_RTC_RTCOUT1                      _UL_(_U_(1) << 31) /**< RTC signal: RTC_RTCOUT1 */
/* ========== PIO definition for TC0 peripheral ========== */
#define PIN_PA0B_TC0_TCLK0                         _L_(0)       /**< TC0 signal: TC0_TCLK0 on PA0 mux B */
#define MUX_PA0B_TC0_TCLK0                         _L_(1)       /**< TC0 signal line function value: TC0_TCLK0 */
#define PIO_PA0B_TC0_TCLK0                         _UL_(_U_(1) << 0) /**< TC0 signal: TC0_TCLK0 */
#define PIN_PA3B_TC0_TCLK1                         _L_(3)       /**< TC0 signal: TC0_TCLK1 on PA3 mux B */
#define MUX_PA3B_TC0_TCLK1                         _L_(1)       /**< TC0 signal line function value: TC0_TCLK1 */
#define PIO_PA3B_TC0_TCLK1                         _UL_(_U_(1) << 3) /**< TC0 signal: TC0_TCLK1 */
#define PIN_PA6B_TC0_TCLK2                         _L_(6)       /**< TC0 signal: TC0_TCLK2 on PA6 mux B */
#define MUX_PA6B_TC0_TCLK2                         _L_(1)       /**< TC0 signal line function value: TC0_TCLK2 */
#define PIO_PA6B_TC0_TCLK2                         _UL_(_U_(1) << 6) /**< TC0 signal: TC0_TCLK2 */
#define PIN_PA1B_TC0_TIOA0                         _L_(1)       /**< TC0 signal: TC0_TIOA0 on PA1 mux B */
#define MUX_PA1B_TC0_TIOA0                         _L_(1)       /**< TC0 signal line function value: TC0_TIOA0 */
#define PIO_PA1B_TC0_TIOA0                         _UL_(_U_(1) << 1) /**< TC0 signal: TC0_TIOA0 */
#define PIN_PA4B_TC0_TIOA1                         _L_(4)       /**< TC0 signal: TC0_TIOA1 on PA4 mux B */
#define MUX_PA4B_TC0_TIOA1                         _L_(1)       /**< TC0 signal line function value: TC0_TIOA1 */
#define PIO_PA4B_TC0_TIOA1                         _UL_(_U_(1) << 4) /**< TC0 signal: TC0_TIOA1 */
#define PIN_PA7B_TC0_TIOA2                         _L_(7)       /**< TC0 signal: TC0_TIOA2 on PA7 mux B */
#define MUX_PA7B_TC0_TIOA2                         _L_(1)       /**< TC0 signal line function value: TC0_TIOA2 */
#define PIO_PA7B_TC0_TIOA2                         _UL_(_U_(1) << 7) /**< TC0 signal: TC0_TIOA2 */
#define PIN_PA2B_TC0_TIOB0                         _L_(2)       /**< TC0 signal: TC0_TIOB0 on PA2 mux B */
#define MUX_PA2B_TC0_TIOB0                         _L_(1)       /**< TC0 signal line function value: TC0_TIOB0 */
#define PIO_PA2B_TC0_TIOB0                         _UL_(_U_(1) << 2) /**< TC0 signal: TC0_TIOB0 */
#define PIN_PA5B_TC0_TIOB1                         _L_(5)       /**< TC0 signal: TC0_TIOB1 on PA5 mux B */
#define MUX_PA5B_TC0_TIOB1                         _L_(1)       /**< TC0 signal line function value: TC0_TIOB1 */
#define PIO_PA5B_TC0_TIOB1                         _UL_(_U_(1) << 5) /**< TC0 signal: TC0_TIOB1 */
#define PIN_PA8B_TC0_TIOB2                         _L_(8)       /**< TC0 signal: TC0_TIOB2 on PA8 mux B */
#define MUX_PA8B_TC0_TIOB2                         _L_(1)       /**< TC0 signal line function value: TC0_TIOB2 */
#define PIO_PA8B_TC0_TIOB2                         _UL_(_U_(1) << 8) /**< TC0 signal: TC0_TIOB2 */
/* ========== PIO definition for TC1 peripheral ========== */
#define PIN_PB8A_TC1_TCLK3                         _L_(40)      /**< TC1 signal: TC1_TCLK3 on PB8 mux A */
#define MUX_PB8A_TC1_TCLK3                         _L_(0)       /**< TC1 signal line function value: TC1_TCLK3 */
#define PIO_PB8A_TC1_TCLK3                         _UL_(_U_(1) << 8) /**< TC1 signal: TC1_TCLK3 */
#define PIN_PB11A_TC1_TCLK4                        _L_(43)      /**< TC1 signal: TC1_TCLK4 on PB11 mux A */
#define MUX_PB11A_TC1_TCLK4                        _L_(0)       /**< TC1 signal line function value: TC1_TCLK4 */
#define PIO_PB11A_TC1_TCLK4                        _UL_(_U_(1) << 11) /**< TC1 signal: TC1_TCLK4 */
#define PIN_PB14A_TC1_TCLK5                        _L_(46)      /**< TC1 signal: TC1_TCLK5 on PB14 mux A */
#define MUX_PB14A_TC1_TCLK5                        _L_(0)       /**< TC1 signal line function value: TC1_TCLK5 */
#define PIO_PB14A_TC1_TCLK5                        _UL_(_U_(1) << 14) /**< TC1 signal: TC1_TCLK5 */
#define PIN_PB9A_TC1_TIOA3                         _L_(41)      /**< TC1 signal: TC1_TIOA3 on PB9 mux A */
#define MUX_PB9A_TC1_TIOA3                         _L_(0)       /**< TC1 signal line function value: TC1_TIOA3 */
#define PIO_PB9A_TC1_TIOA3                         _UL_(_U_(1) << 9) /**< TC1 signal: TC1_TIOA3 */
#define PIN_PB12A_TC1_TIOA4                        _L_(44)      /**< TC1 signal: TC1_TIOA4 on PB12 mux A */
#define MUX_PB12A_TC1_TIOA4                        _L_(0)       /**< TC1 signal line function value: TC1_TIOA4 */
#define PIO_PB12A_TC1_TIOA4                        _UL_(_U_(1) << 12) /**< TC1 signal: TC1_TIOA4 */
#define PIN_PB15A_TC1_TIOA5                        _L_(47)      /**< TC1 signal: TC1_TIOA5 on PB15 mux A */
#define MUX_PB15A_TC1_TIOA5                        _L_(0)       /**< TC1 signal line function value: TC1_TIOA5 */
#define PIO_PB15A_TC1_TIOA5                        _UL_(_U_(1) << 15) /**< TC1 signal: TC1_TIOA5 */
#define PIN_PB10A_TC1_TIOB3                        _L_(42)      /**< TC1 signal: TC1_TIOB3 on PB10 mux A */
#define MUX_PB10A_TC1_TIOB3                        _L_(0)       /**< TC1 signal line function value: TC1_TIOB3 */
#define PIO_PB10A_TC1_TIOB3                        _UL_(_U_(1) << 10) /**< TC1 signal: TC1_TIOB3 */
#define PIN_PB13A_TC1_TIOB4                        _L_(45)      /**< TC1 signal: TC1_TIOB4 on PB13 mux A */
#define MUX_PB13A_TC1_TIOB4                        _L_(0)       /**< TC1 signal line function value: TC1_TIOB4 */
#define PIO_PB13A_TC1_TIOB4                        _UL_(_U_(1) << 13) /**< TC1 signal: TC1_TIOB4 */
#define PIN_PB16A_TC1_TIOB5                        _L_(48)      /**< TC1 signal: TC1_TIOB5 on PB16 mux A */
#define MUX_PB16A_TC1_TIOB5                        _L_(0)       /**< TC1 signal line function value: TC1_TIOB5 */
#define PIO_PB16A_TC1_TIOB5                        _UL_(_U_(1) << 16) /**< TC1 signal: TC1_TIOB5 */
/* ========== PIO definition for TC2 peripheral ========== */
#define PIN_PC11A_TC2_TCLK6                        _L_(75)      /**< TC2 signal: TC2_TCLK6 on PC11 mux A */
#define MUX_PC11A_TC2_TCLK6                        _L_(0)       /**< TC2 signal line function value: TC2_TCLK6 */
#define PIO_PC11A_TC2_TCLK6                        _UL_(_U_(1) << 11) /**< TC2 signal: TC2_TCLK6 */
#define PIN_PC14A_TC2_TCLK7                        _L_(78)      /**< TC2 signal: TC2_TCLK7 on PC14 mux A */
#define MUX_PC14A_TC2_TCLK7                        _L_(0)       /**< TC2 signal line function value: TC2_TCLK7 */
#define PIO_PC14A_TC2_TCLK7                        _UL_(_U_(1) << 14) /**< TC2 signal: TC2_TCLK7 */
#define PIN_PC17A_TC2_TCLK8                        _L_(81)      /**< TC2 signal: TC2_TCLK8 on PC17 mux A */
#define MUX_PC17A_TC2_TCLK8                        _L_(0)       /**< TC2 signal line function value: TC2_TCLK8 */
#define PIO_PC17A_TC2_TCLK8                        _UL_(_U_(1) << 17) /**< TC2 signal: TC2_TCLK8 */
#define PIN_PC12A_TC2_TIOA6                        _L_(76)      /**< TC2 signal: TC2_TIOA6 on PC12 mux A */
#define MUX_PC12A_TC2_TIOA6                        _L_(0)       /**< TC2 signal line function value: TC2_TIOA6 */
#define PIO_PC12A_TC2_TIOA6                        _UL_(_U_(1) << 12) /**< TC2 signal: TC2_TIOA6 */
#define PIN_PC15A_TC2_TIOA7                        _L_(79)      /**< TC2 signal: TC2_TIOA7 on PC15 mux A */
#define MUX_PC15A_TC2_TIOA7                        _L_(0)       /**< TC2 signal line function value: TC2_TIOA7 */
#define PIO_PC15A_TC2_TIOA7                        _UL_(_U_(1) << 15) /**< TC2 signal: TC2_TIOA7 */
#define PIN_PC18A_TC2_TIOA8                        _L_(82)      /**< TC2 signal: TC2_TIOA8 on PC18 mux A */
#define MUX_PC18A_TC2_TIOA8                        _L_(0)       /**< TC2 signal line function value: TC2_TIOA8 */
#define PIO_PC18A_TC2_TIOA8                        _UL_(_U_(1) << 18) /**< TC2 signal: TC2_TIOA8 */
#define PIN_PC13A_TC2_TIOB6                        _L_(77)      /**< TC2 signal: TC2_TIOB6 on PC13 mux A */
#define MUX_PC13A_TC2_TIOB6                        _L_(0)       /**< TC2 signal line function value: TC2_TIOB6 */
#define PIO_PC13A_TC2_TIOB6                        _UL_(_U_(1) << 13) /**< TC2 signal: TC2_TIOB6 */
#define PIN_PC16A_TC2_TIOB7                        _L_(80)      /**< TC2 signal: TC2_TIOB7 on PC16 mux A */
#define MUX_PC16A_TC2_TIOB7                        _L_(0)       /**< TC2 signal line function value: TC2_TIOB7 */
#define PIO_PC16A_TC2_TIOB7                        _UL_(_U_(1) << 16) /**< TC2 signal: TC2_TIOB7 */
#define PIN_PC19A_TC2_TIOB8                        _L_(83)      /**< TC2 signal: TC2_TIOB8 on PC19 mux A */
#define MUX_PC19A_TC2_TIOB8                        _L_(0)       /**< TC2 signal line function value: TC2_TIOB8 */
#define PIO_PC19A_TC2_TIOB8                        _UL_(_U_(1) << 19) /**< TC2 signal: TC2_TIOB8 */
/* ========== PIO definition for TC3 peripheral ========== */
#define PIN_PC21D_TC3_TCLK9                        _L_(85)      /**< TC3 signal: TC3_TCLK9 on PC21 mux D */
#define MUX_PC21D_TC3_TCLK9                        _L_(3)       /**< TC3 signal line function value: TC3_TCLK9 */
#define PIO_PC21D_TC3_TCLK9                        _UL_(_U_(1) << 21) /**< TC3 signal: TC3_TCLK9 */
#define PIN_PC28D_TC3_TCLK10                       _L_(92)      /**< TC3 signal: TC3_TCLK10 on PC28 mux D */
#define MUX_PC28D_TC3_TCLK10                       _L_(3)       /**< TC3 signal line function value: TC3_TCLK10 */
#define PIO_PC28D_TC3_TCLK10                       _UL_(_U_(1) << 28) /**< TC3 signal: TC3_TCLK10 */
#define PIN_PC25D_TC3_TCLK11                       _L_(89)      /**< TC3 signal: TC3_TCLK11 on PC25 mux D */
#define MUX_PC25D_TC3_TCLK11                       _L_(3)       /**< TC3 signal line function value: TC3_TCLK11 */
#define PIO_PC25D_TC3_TCLK11                       _UL_(_U_(1) << 25) /**< TC3 signal: TC3_TCLK11 */
#define PIN_PC22D_TC3_TIOA9                        _L_(86)      /**< TC3 signal: TC3_TIOA9 on PC22 mux D */
#define MUX_PC22D_TC3_TIOA9                        _L_(3)       /**< TC3 signal line function value: TC3_TIOA9 */
#define PIO_PC22D_TC3_TIOA9                        _UL_(_U_(1) << 22) /**< TC3 signal: TC3_TIOA9 */
#define PIN_PC29D_TC3_TIOA10                       _L_(93)      /**< TC3 signal: TC3_TIOA10 on PC29 mux D */
#define MUX_PC29D_TC3_TIOA10                       _L_(3)       /**< TC3 signal line function value: TC3_TIOA10 */
#define PIO_PC29D_TC3_TIOA10                       _UL_(_U_(1) << 29) /**< TC3 signal: TC3_TIOA10 */
#define PIN_PC26D_TC3_TIOA11                       _L_(90)      /**< TC3 signal: TC3_TIOA11 on PC26 mux D */
#define MUX_PC26D_TC3_TIOA11                       _L_(3)       /**< TC3 signal line function value: TC3_TIOA11 */
#define PIO_PC26D_TC3_TIOA11                       _UL_(_U_(1) << 26) /**< TC3 signal: TC3_TIOA11 */
#define PIN_PC24D_TC3_TIOB9                        _L_(88)      /**< TC3 signal: TC3_TIOB9 on PC24 mux D */
#define MUX_PC24D_TC3_TIOB9                        _L_(3)       /**< TC3 signal line function value: TC3_TIOB9 */
#define PIO_PC24D_TC3_TIOB9                        _UL_(_U_(1) << 24) /**< TC3 signal: TC3_TIOB9 */
#define PIN_PC30D_TC3_TIOB10                       _L_(94)      /**< TC3 signal: TC3_TIOB10 on PC30 mux D */
#define MUX_PC30D_TC3_TIOB10                       _L_(3)       /**< TC3 signal line function value: TC3_TIOB10 */
#define PIO_PC30D_TC3_TIOB10                       _UL_(_U_(1) << 30) /**< TC3 signal: TC3_TIOB10 */
#define PIN_PC27D_TC3_TIOB11                       _L_(91)      /**< TC3 signal: TC3_TIOB11 on PC27 mux D */
#define MUX_PC27D_TC3_TIOB11                       _L_(3)       /**< TC3 signal line function value: TC3_TIOB11 */
#define PIO_PC27D_TC3_TIOB11                       _UL_(_U_(1) << 27) /**< TC3 signal: TC3_TIOB11 */

#endif /* _SAMRH71F20B_GPIO_H_ */

